{
    "Vectorization Research": "﻿Understanding Vector Embeddings: How to Choose the Right Model for Your RAG Pipeline:\r\n* Seems like companies train models to vectorize (ex. OpenAI v3, Voyage AI)\r\n   * OpenAI v3: Adjustable vector sizes\r\n   * Voyage AI: Remarkably small vector (1204 size)\r\n* We need to train vectorization models?\r\n* When vectorizing, pre-separate data\r\n* Chunk size and overlap\r\nHow to Train a Custom LLM Embedding Model:\r\n* Colab: Training an Embedding LLM\r\n   * Uses “Gist Large Embedding v0”\r\n   * The colab literally shows they ran out of RAM\r\n* When training, nodes (sentences) contain metadata about neighboring sentences\r\n* Uses “zephyr-7b-data” but separately “fine-tunes” with Gist Large Embedding v0?\r\n  \r\n \r\n\r\n\r\nhttps://stackoverflow.com/questions/73969269/error-could-not-build-wheels-for-hnswlib-which-is-required-to-install-pyprojec \r\n\r\n\r\n\r\n\r\nTYLER:\r\n* https://docs.vectorize.io/rag-evaluation/rag-sandbox\r\n   *    * \r\n\r\n\r\n\r\nRohin\r\n* https://docs.trychroma.com/docs/overview/getting-started\r\n*",
    "VectorDB Research": "﻿Possible db for vector RAG:\r\n* Redis (5/month for flex or 12/month for pro) \r\n* Qdrant ($0.014 per hour, ~6/month)\r\n* Milvus (25/month)\r\n* Weaviate (25/month)\r\n* pinecone (25/month)\r\n* MongoDB\r\n\r\n\r\nRequirements: Affordable, easy to use, supports vectors!\r\n\r\n\r\n🏯\r\nWe can use Docker to use Qdrant locally: https://qdrant.tech/documentation/quickstart/ \r\nRedis tutorials: https://redis.io/learn",
    "CRChat": "﻿1/16/2025\r\nToDo:\r\n* figure out how to loop the chat so that it doesnt terminate after just one interaction\r\n* When looping, add user queries and responses to history/context\r\n\r\n\r\n1/25/2025\r\n*",
    "Facts": "﻿* Ethan Decamp goes by EDC445\r\n* Ethan Decamp is 5’10\r\n* Rohin Phukan is 5’11",
    "Semester Recap and Prep": "﻿The goal of this document is to summarize the progress CRCloud has made this past semester and all the work that has been done, as well as prepare for next semester and the joining of new members.\r\n\r\n\r\nRecap:\r\n* The completion of the Weekly Reminder API\r\n   * Java finished implementing the specific functions of the API, such as create, edit, and delete.\r\n   * Now, members can easily use these functions to handle and use the Weekly Reminder bot.\r\n   * Context: When the Weekly Reminder bot used to post its reminders, none of the members were able to edit or delete them. This is because of the way member permissions coincided with the bot’s permissions on Slack. As a solution, we decided to create API functions that we could use to call on the bot itself and commit those changes.\r\n* CRChat\r\n   * When brainstorming possible projects for us after the Weekly Reminder bot, we settled on CRChat, an easy-to-use chatbot specialized in everything CRC and combat robotics related.\r\n   * Value Proposition: CRChat would be directly integrated into our Slack, allowing users to easily ask it questions in a DM. It could also be pinged in other channels to have it respond to questions there. CRChat would be more useful than other popular chatbot options, such as ChatGPT, because it is already based on popular LLM models and specially trained in combat robotics/CRC. There are niches only CRChat would understand and be able to help with.\r\n* Implementation of CRChat\r\n   * First, we experimented with Meta’s open-source model Llama on our local computers. It was to get a sense of what we wanted to build and how it would be utilized.\r\n   * Shao uploaded the local Llama model to the AWS cloud, testing to see if we could use it non-locally. (The vision of CRChat would have the model hosted on AWS, and we send requests on the cloud to that model.) This took quite a bit of debugging and troubleshooting.\r\n   * Research was done into the exact pipeline and workflow of CRChat. In the November-December document, we drafted a preliminary version of the entire process:\r\n1. User asks a message on Slack to CRChat.\r\n2. Send that request to API Gateway, temporarily storing user inputs in an S3 bucket for easy access.\r\n3. Invoke the Lambda function, which queries the hosted Llama model and returns the output.\r\n4. API Gateway returns the Lambda response to Slack, which is posted as a response to the user’s question.\r\n   * Evan created the CRChat Slack app and enabled DM messages to be able to be sent, preparing for input submission.\r\n\r\n\r\nFor next semester:\r\n* Finalize hosting a model on the cloud, if not done yet.\r\n* Onboard new members, explaining the project’s goal and past progress.\r\n* Get familiar with the tech stack and tools/resources we will be using.\r\n* Implement the pipeline.",
    "CRCloud - November - Implementation Phase": "﻿Iteration 1: local development:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nIteration 2: Cloud deployment:\r\n\r\n\r\nPotential Workflow\r\n1. Model Hosting on Lambda\r\n   1. Since AWS Lambda has a memory limit (up to 10 GB), consider packaging a smaller version of the model (e.g., a distilled or fine-tuned variant of Llama 3.2).\r\n   2. May need to package dependencies carefully. Use AWS Lambda Layers for model dependencies (e.g., PyTorch, Transformers library).\r\n   3. Deploy the Lambda function in a compatible language runtime, such as Python.\r\n2. User Input Handling, two options\r\n   1. Create a Slack app that sends user queries to the backend.\r\n   2. For a web app, set up an input field and button for user submission, directing queries to API Gateway.\r\n3. Processing the Input\r\n   1. Use AWS API Gateway as the interface between user input and the Lambda function.\r\n   2. Configure API Gateway to receive requests from the Slack app or web app, validating and forwarding these requests in JSON format to the Lambda function.\r\n   3. Initially, we will simply store the user input on the cloud in a S3 bucket. This will allow us to access these prompts easily from other AWS services.\r\n4. Lambda Execution\r\n   1. Lambda receives JSON input, processes it, and calls the Llama model. Process and return the chatbot response in JSON format.\r\n   2. For performance, limit the model's response size or summarize output if lengthy.\r\n5. Event Coordination (Optional)\r\n   1. If you need more flexibility in routing or managing responses (e.g., retries, complex workflows), AWS EventBridge could be added to trigger Lambda based on events. This is helpful if other AWS services are involved or if we anticipate multiple event sources.\r\n6. Returning the Response\r\n   1. API Gateway returns the Lambda response to the originating app (Slack or web app).\r\n   2. For Slack, handle the response as a message reply. For a web app, display the response in a chat UI.\r\n\r\n\r\nKey AWS Services Summary\r\nLambda: Model hosting and response generation.\r\nAPI Gateway: Request routing.\r\nEventBridge (optional): Event management, if needed.\r\nS3: Storing user input/prompts.",
    "CRCloud-Sept-October - Brainstorm Phase": "﻿9/21:\r\n1. Virtual Assistance:\r\n   1. Technical Doc\r\n   2. Dating Simulation \r\n   3. Meeting Note Recap\r\n   4. Meeting reminder (when is my next meeting?)/task reminder (do I have upcoming tasks?)\r\n   5. Social/Event calendar\r\n      1. Maybe a week in review?\r\n   6. Slack Bot DM for CRChat\r\n2. Weekly Report Reminder API\r\n3. Discussion Summarizer\r\n4. Full Team Task reminder\r\n\r\n\r\nUse RAG\r\nhttps://medium.com/@bijit211987/advanced-rag-for-llms-slms-5bcc6fbba411\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nImplementation Details aka Crazy 8’s:\r\nSome steps for a prototype of your local machine:\r\n1. Data Collection:\r\n   * Collect data related to combat robotics (articles, research papers, blog posts, manuals, and documentation). Collect and store this data in a structured format (text files, PDFs, or a database).\r\n   * Web scraping tools like BeautifulSoup or Scrapy, or Work with APIs, for example – Wikipedia \r\n2. Language Model:\r\n   * Start with a pre-trained language model (like GPT-3, GPT-4, Hugging Face's GPT-Neo or GPT-J). \r\n   * Adapt this model using combat robotics-related content \r\n   * Question to answer: Can we get our model to perform better than general GPT?\r\n3. Document Search & Retrieval & Answer\r\n   * Use a retrieval engine to search through the collected documents. This can be done with libraries like Haystack\r\n   * The retrieved data will be passed to the language model, which will use it to generate answers.\r\n4. Interface (Chat Interface):\r\n   * Build a simple web-based chat interface using Flask or Streamlit or Slack. \r\n   * Want to have a small Proof of Concept before go to cloud, and make it better\r\n\r\n\r\nhttps://medium.com/@weidagang/hello-llm-building-a-local-chatbot-with-langchain-and-llama2-3a4449fc4c03\r\n\r\n\r\nhttps://medium.com/@guandika8/on-your-local-pc-a-local-chatbot-that-is-completely-offline-and-private-26b298dc4076",
    "Questions for CRClaw": "﻿Goal: Automate the Claw tasks so that they don’t need to keep track of system shutdown, the amount of items that’s left, and internal status of the machine.\r\n\r\n\r\nThings to consider:\r\nSet a cloudwatch alarm to notify us whenever the system goes down\r\nUse cloudwatch metrics to track how many games had been played and how many coins left\r\nUse cloudwatch log to track the internal status of the system, which can be helpful for debugging later on\r\n\r\n\r\nQuestions:\r\n1. How would you define a system shutdown for the claw machine, what would be the possible situation?\r\n2. What items do you plan to put in the claw machines?\r\n3. Adding a nice LED touch screen",
    "Meeting Notes Spring 2024": "﻿Mar 24, 2024 | Slackbot Project Meeting\r\nAttendees: Javohir Abdurazzakov Evan Zhu Rachel Pineda Shao StassenSana Gaya\r\n\r\n\r\nNotes\r\nGeneral: \r\n1. Giving more permission on services like lambda/S3, or find a systematic way to bypass/workaround on AWS\r\n2. Make sure to document errors and the solutions\r\nRachel:\r\nCreate lambda function to retrieve images from slack channel and send to s3\r\n* Issues with permissions to put images in s3 bucket\r\n* Potential solution: Grant PutObject Permission in the S3 service\r\nError Message: \r\n{\r\n  \"errorMessage\": \"An error occurred (AccessDenied) when calling the PutObject operation: Access Denied\",\r\n  \"errorType\": \"ClientError\",\r\n  \"requestId\": \"86c85248-043b-445d-80aa-0d3adac7ce3e\",\r\n  \"stackTrace\": [\r\n    \"  File \\\"/var/task/lambda_function.py\\\", line 34, in lambda_handler\\n    process_and_upload_to_s3(image_url, slack_token)\\n\",\r\n    \"  File \\\"/var/task/lambda_function.py\\\", line 28, in process_and_upload_to_s3\\n    s3.put_object(Body=image_data, Bucket=S3_BUCKET_NAME, Key='processed_image.jpg')\\n\",\r\n    \"  File \\\"/var/lang/lib/python3.12/site-packages/botocore/client.py\\\", line 553, in _api_call\\n    return self._make_api_call(operation_name, kwargs)\\n\",\r\n    \"  File \\\"/var/lang/lib/python3.12/site-packages/botocore/client.py\\\", line 1009, in _make_api_call\\n    raise error_class(parsed_response, operation_name)\\n\"\r\n  ]\r\n}\r\n\r\n\r\n\r\n\r\nJava: \r\nCreate an organizer lambda function and a generalized weekly report lambda function. The organizer sets the channel, token, and message for the reminder in the generalized weekly report lambda function. It does this by taking in the event parameters when the API is called. This organizer function also sets up a new schedule with all the required parameters filled up using boto3’s create_schedule. So in theory, this organizer function should do 2 things: set up the event schedule for every week (or desired time) and set up the destination of the message and specify the sending bot.\r\n\r\n\r\nI just need more time to create the organizer function, i'm still getting the hang of using boto3’s create_schedule and making event bridge schedules. The generalized weekly report function is done though. It works as expected. So almost done with the 4th out of 4 APIs. \r\n\r\nNext meeting, spend like 30 minutes finalizing the function. So put the payload in the test event rather than the code. Also make the other 3 functions (send, edit, delete) rely on event given info for slack channel and token rather than relying on the OS Environment. Finally, make an installation and documentation page for these 4 APIs, with the focus on the weekly report api. The installation guide should tell users how to install a token into their slack channel/organization and how to invoke our APIs (which is just pasting the invoke REST API url plus the ? plus the parameters. Separate by comma, have the key in quotes, followed by colon, followed by the definition for that key. \r\n\r\n\r\n\r\n\r\nEvan and Shao:\r\n* Researched AWS CloudWatch functionality and observed that CRC AWS has some current Cloudwatch alarm\r\n* Drafted possible implementations with CRClaw, proposed questions Questions for CRClaw\r\n* Created a Python script that takes in user input as integer, and return system shutdown only if the user input = 0 for the system shutdown feature of the CLAW\r\n\r\n\r\n\r\n\r\nProblem:\r\n* Intention: putting a CloudWatch on a testing Lambda function, and send message to Slack based on the behavior of the system\r\n* When trying to create a Lambda function template[a](“Send CloudWatch alarm notifications via SNS, an Amazon SNS trigger that sends CloudWatch alarm notifications to Slack”) to test CloudWatch, ran into issues:\r\n   * Their steps to configure a webhook in Slack was outdated and deprecated.\r\n   * SNS Trigger: I need to select a SNS topic to subscribe to, but to do that I need to copy-paste over a topic’s ARN. I made a SNS topic, but don’t have access to its ARN.\r\n        This is the error message I was receiving when trying to access the topic’s ARN:\r\n* Couldn't retrieve topic attributes.\r\n* Error code: AuthorizationError - Error message: User: arn:aws:iam::891377090032:user/Evan is not authorized to perform: SNS:GetTopicAttributes on resource: arn:aws:sns:us-east-1:891377090032:CloudWatch-Test because no identity-based policy allows the SNS:GetTopicAttributes action\r\n\r\n\r\nPotential Solution: \r\n1. Grant Topic Attributes\r\n2. Use a different template\r\n3. Grant creating Lambda Function from scratch \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n[a]Doesn't have the permission to make it from scratch",
    "New  Slackbot": "﻿1/15:\r\nThings done so far:\r\n* The bot can periodically send messages to automate reminders under “Weekly_Report_Reminder”\r\n* This video details sending messages using Node.js\r\n* Checking who has replied in the thread to a message with an attachment, rather than reacting; if you haven’t responded with an attachment, send a ping with a reminder to the channel under “Fine_Grain_Weekly_Report_Reminder”\r\n* Code was developed in Python because of preinstalled dependencies; started with the Node.js video to set up the account and bot\r\n\r\n\r\nNext steps:\r\n* Can do any language really\r\n* Set up git repo\r\n* Editing/Deleting messages that the bot sent if we send the wrong week or send a message accidentally\r\n   * Don’t need the AWS account for this feature\r\n   * AWS is necessary to send messages at specific times; the server hosts the timing for us, but editing/deleting we can do on our own\r\n   * Run the python bot from our own machines to edit messages\r\n* \r\n\r\nRichard’s comments: Personal interests/Reasons to work on Slackbot\r\n* Practice with Github\r\n* The project is a great way for newbies especially to get a taste for the real world of tech (Amazon AWS)\r\n* Preparing for group work asynchronously and reliance on API documentation from other developers; avoiding repeated development\r\n* Consulting and calling API, using other people’s code as foundation\r\n* Good for internships\r\n\r\n\r\n1/16: \r\nTo delete an app:\r\n* Go to app directory\r\n* Find the app\r\n* Open the configurations\r\n* Delete the app\r\n\r\n\r\nWhat we did today:\r\n* Removed Lucid, Zoom apps to make room for Slackbot-V4\r\n* Imported the OS but had problems with loading it, so removed it and just pasted the API key\r\n* Split the functions between the newbies \r\n* Tuesday night, Shao got the bot working",
    "Meeting Minutes": "﻿1/28/2023\r\nAttendees: Ethan, Grace, Linda, Shao, Matthew, Sardor\r\n* Caught up new members on the file\r\n* Booked meeting room in Morrison weekly\r\n* Finished all but two methods together using live share on VS code\r\n* We have no idea how to actually make the bot run on slack and test the methods we wrote\r\n* Made a sort of method hierarchy/dependency graph on Ethan’s iPad\r\n\r\n\r\n2/4/2023\r\nAttendees: Ethan, Sardor, Shao, Linda, Luke\r\nAgenda:\r\n* Set up testing / Connect to server\r\n* Finish (via testing) extract_deadline and check_reaction\r\n* Got NGROK to run for the last 10 minutes\r\n* Luke looked over all our code",
    "SlackBot Research": "﻿General Info\r\nYoutube Video: https://www.youtube.com/watch?v=CtsDkcSYHe0 \r\nhttps://slack.com/help/articles/115005265703-Create-a-bot-for-your-workspace\r\nhttps://api.slack.com/apis/connections/events-api\r\nPython Slack Bot Tutorial #1 - Setup & Sending Messages\r\n\r\n\r\n\r\n\r\n1. Reaction Tractor\r\nhttps://api.slack.com/messaging/sending\r\nhttps://api.slack.com/events/reaction_added\r\n\r\n\r\n\r\n\r\n\r\n\r\n2. Photo Downloader\r\nhttps://api.slack.com/methods/reactions.get\r\n\r\n\r\n\r\n\r\n3. Attendance Tracker"
}