{
    "How-To_ Design for Different Manufacturing Methods.txt": "How to design for different manufacturing methods\n\n\n\nDesigning for 3D printing\n\nstuff shrinks\n\nsupports\n\n\n\nDesigning for 2D manufacturing (i.e. laser cutting, water jetting)\n\nBoth laser cutting and water jetting can only cut 2D geometry. \n\n\n\nDesigning for CNC machining\n\nno sharp inner corners",
    "How-to_ GitHub.txt": "Slides references: \n\n\n\nW1M2 Marketing and Auton: GitHub\n\nW2M2 Auton: Python\n\n\n\n\n\nGITHUB\n\n\n\n\n\nHow to Clone a Repository - SSH\n\n\n\nNavigate to the GitHub page of the repository you want to clone and locate the green “<> Code” button\n\nClick on the SSH tab\n\nCopy the SSH url\n\nGo to your laptop’s terminal\n\n“git clone [ssh_url]”\n\n\n\n\n\nHow to Pull Code From Main Branch\n\n\n\nTo pull code from the main branch when you already have changes locally:\n\nStash Your Changes: If you have local changes that you want to save for later, use git stash to temporarily store them.\n\nPull the Latest Code from the Main Branch:\n\n“git pull origin main”\n\nApply Your Stashed Changes: Once the latest code is pulled, you can reapply your changes by using \n\n“git stash pop”\n\nAlternatively, if you want to merge your changes with the latest code without stashing, you can use: \n\n“git pull --rebase origin main”\n\nThis will apply your changes on top of the updated main branch, reducing the likelihood of merge conflicts.\n\n\n\n\n\nHow to Commit Code to Local Repository\n\n\n\nAfter making changes, stage your changes for commit using \n\n“git add <filename> or git add .” (to add all changes) \n\nThen, commit with a descriptive message:\n\n “git commit -m \"your descriptive message\"\n\nRemember to always write **clear and concise** commit messages that describe the change in the code.\n\n\n\nNote: “git commit -a -m \"your descriptive message\" combines “git add .” and “git commit -m \"your descriptive message\"\n\n\n\n\n\nHow to Resolve Merge Conflicts \n\n\n\nGit cannot resolve differences between two separate commits.\n\n\n\nTypes of Merge Conflicts:\n\nEdit Conflict\n\nDelete-Edit Conflict \n\nContent Conflict\n\n\n\nYou can resolve merge conflicts by:\n\nEditing the file\n\nStashing changes\n\ngit stash\n\ngit pull\n\ngit stash pop\n\nMerge editor\n\nAdd files and commit the change\n\n\n\nFor more reference: resolve merge conflicts\n\n\n\n\n\nHow to Use Branches\n\n\n\n*Branches allow you to work on new features or bug fixes separately from the main codebase. \n\n\n\nAlways create a new branch for each feature or fix\n\n“git branch <new-branch-name>”\n\n“git checkout -b <new-branch-name>”\n\n“git switch -c <new-branch-name>”\n\n\n\nOnce the work is complete, merge it back to the main branch.\n\n“git checkout main”\n\n“git merge <completed-branch-name>”\n\n\n\nNote: To keep the branches organized, you should always delete a branch once you finished implementing a feature and undergo code review, or successfully implement and fully test a fix to a bug\n\n\n\nHow to Delete a Branch\n\n\n\nLocally: \n\ngit branch -d <branch-name> safe delete \n\ngit branch -D <branch-name> force delete\n\n\n\nRemotely:\n\ngit push origin --delete <branch-name>\n\n\n\nHow to Switch to Existing Branches\n\n\n\n“git switch <existing-branch>”\n\n“git checkout <existing branch>”\n\n\n\n\n\n\n\n\n\n\n\nGOOD CODING PRACTICES\n\n\n\n\n\nNaming Conventions\n\n\n\nHere are the criteria that make a good commit message:\n\nThe first line is less than 50 characters, with the first one capitalized. The words complete the sentence \"If you pulled this commit into your own copy of the repo, this commit would...\" You are informing the reader what value they are getting from your commit.\n\nThe second line is blank.\n\nThe remaining lines supply details.\n\n\n\nVariables: snake_case\n\nFunctions: snake_case()\n\nClasses: PascalCase\n\nConstants: ALL_CAPS\n\n\n\n\n\nAlways Work in GitHub Branches How-to: Code & GitHub\n\n\n\n*Avoid working directly in the main branch. Create a new branch for each task, allowing others to review changes before merging into the main codebase.\n\n\n\n\n\nUpdate README.md Often \n\n\n\n*The README.md should provide an overview of the project, setup instructions, and any relevant information on usage. Keep it updated, especially when new features are added.\n\n\n\n\n\nGitHub Pull Before Pushing How-to: Code & GitHub\n\n\n\n*Always run git pull before pushing changes to ensure your local code is up-to-date with the remote repository. This helps prevent conflicts and potential merge conflicts.\n\n\n\n\n\nClasses\n\n\n\nUse classes to encapsulate related functions and data, especially for larger projects. Each class should have a single responsibility.\n\n\n\n\n\nGlobal Constants/Variables\n\n\n\nGlobal Constants and variables are values defined at the top of a file. We should use them because it makes it easier to modify values and results in cleaner code. We should use them anytime we have to hardcode a value\n\n\n\n\n\nEnvironments\n\n\n\nAn environment is a directory containing a collection of software tools and installed packages. The benefit of using environments is it would prevent package collision errors. Install Conda → environment management system\n\n\n\nvenv commands:\n\npython -m venv <directory>\n\nsource <directory>/bin/activate | venv\\Scripts\\Activate.ps1\n\ndeactivate\n\nrm -r <directory>\n\n\n\nConda Commands: \n\nconda create --name <environment name>\n\nconda activate <environment name>\n\nconda deactivate\n\nconda env list\n\nLists all of your environments\n\nconda list\n\nSee which packages are installed in your current environment\n\nUse pip to install python packages once you’re on your environment\n\n\n\n\n\nSetup.sh\n\n\n\nA setup script (setup.sh) can automate the setup process, installing necessary packages and configuring the environment. Use this to streamline the project setup for new contributors.\n\n\n\n\n\n.gitignore\n\n\n\nThe “.gitignore” file specifies files and directories that should not be tracked by Git (e.g., sensitive data, large binary files, and local configuration files). Be sure to keep it updated.\n\n\n\n\n\nRequirements.txt\n\n\n\nA requirements.txt file lists all necessary packages for a Python project.\n\n\n\n\n\n\n\n\n\n\n\nGIT COMMAND CHEAT SHEET\n\n\n\ngit status →  lists your branch, commit status, and more\n\ngit pull →  pulls from main\n\ngit add <filename> / git add -A / git add . → adds changes to staging area\n\ngit commit -m “commit message” → commits things in staging area locally\n\ngit push → pushed local commit to global repository\n\ngit checkout <branch name> [git checkout main, git checkout test_code] → switches branch\n\ngit branch <new branch name> → creates new branch\n\ngit help →  Gives a list of useful git commands\n\ngit restore <file> → Reverts changes and “restores” previous version of the file(s)\n\ngit rm <file> → Removes file from the working directory. Calling git add, git commit, git push will push the current working directory and remove file from the repo.\n\ngit stash → Stashes changes away (can be recovered), and provides a clean working directory.\n\ngit stash pop → Pops most recent stash back into the working directory",
    "How-To_ Prototype Belt Lengths.txt": "How To Prototype Belt Lengths\n\nWhy should we prototype? \n\nWhile CAD is a very useful tool to model dimensions and positions of most things, belts are tricky because they have variable tension. In order to model this tension, we need to manually use trial and error before we can order any component which has belt axle holes in them. \n\nSetup:\n\nYou will firstly want to make sure you’ve ordered the belts you intend to use, the axles around which the belt will rotate, and any other component which is integral to the structure of the belt system, like bearings, wheels, shafts, or motors. \n\nThe goal with this is to make sure your trial and error system is as close to your final product as possible, so as to better replicate the tension in the actual system.\n\nYou will additionally want continued access to a 3D printer, and PA6-CF or other similarly rigid filament.\n\nPrototyping:\n\nFirst, 3D print the upright as you have designed it in CAD based on the theoretical length and diameter of the belt.\n\nOf course, this will not be accurate the first time, but rather to use as a reference point for whether to adjust the axles further or closer.\n\nAssemble your system using the 3D printed upright, and use the tension in the belt in this setup to determine whether to increase tension by moving the axles further apart, or decrease tension, by moving them closer together.\n\nIf unsure, repeat the below steps for both larger and smaller increments.\n\nModel an Isaac Arc™, similar to the one pictured below. The objective is to create an array of distances between the two axles in as small of a 3D printed object as possible, to save printing time and filament.",
    "List of Vendors.txt": "Batteries\n\nVendor List \n\n\n\nVendor Name\n\nLocation\n\nPros\n\nCons\n\nSMC Racing Batteries-\n\norders@smc-racing.com\n\nhttps://www.smc-racing.com\n\nUSA\n\nWill make custom batteries if you email them\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCNC Milling\n\nInformation\n\n\tCNC milling and turning is best used when stock needs to be cut on 3 axes or more, and is used on plastic and metal stock. \n\nCNC Vendor List\n\n\n\nVendor Name\n\nLocation\n\nPros\n\nCons \n\nZTLTech\n\nrita@ztl.com\n\nyedda@zintilon.com\n\n\n\nChina\n\nCheap\n\nTakes a good amount of time to ship, and can sometimes send parts with different hardness treatments than requested. Getting the part hardness tested to make sure it meets your specifications (Clark Machine Shop can do it locally) is necessary. \n\n\n\nCloses for Chinese New Year, so important to order early\n\nPCBWay\n\nChina\n\nCheap\n\nCloses for Chinese New Year, so important to order early\n\nRapidDirect\n\nChina\n\nCheaper than PCBWay \n\nCloses for Chinese New Year, so important to order early\n\nFictiv\n\nUSA\n\n\n\nLess expensive than Xometry, but still expensive\n\nXometry\n\nUSA\n\nVery high reputation\n\nVery expensive\n\n\n\nLaser Cutting/Water Jetting\n\nInformation\n\n\tLaser cutting and water jetting are two ways to cut 2D parts, as opposed to the 3 axes of a CNC machine. Both these methods functionally have the same purpose in combat robotics, but there are slight differences between the two. Laser cutting is more precise than water jetting, as the minimum cut size for a laser cutter is .15mm, while a waterjet has a minimum cutting slit size of .5mm. However, laser cutters are typically only able to cut materials up to around 35mm thick, while a waterjet can cut through parts as thick as 300mm. Additionally, waterjet cutting is more flexible and can cut a wider range of materials, while laser cutting excels at cutting materials (including but not limited to) glass, metal, wood, and plastic but cannot cut reflective materials due to cutting via heat. \n\nLaser Cutting/Water Jetting Vendor List\n\n\n\nVendor Name\n\nLocation\n\nPros\n\nCons \n\nSendCutSend (2D parts)\n\nUSA\n\nVery fast shipping and turn around time, and one of the cheapest options\n\n\n\nHas most materials in most thicknesses\n\nOnly cuts 2D parts\n\n\n\nCertain materials like Carbon Fiber and Titanium are prohibitively expensive\n\n\n\nIs not good for tight tolerances, due to nature of water jetting\n\nFictiv \n\nUSA\n\nCan make 3D objects like billets\n\n\n\nFor parts with tight tolerances, they are very reliable\n\nMore expensive than SendCutSend and takes longer to send \n\nClark Machine Shop\n\nCornell Campus\n\nSuper quick, can drop stock off at Clark, can machine metals that Emerson cannot \n\nKinda expensive \n\n\n\n\n\nElectrical Discharge Machining\n\nInformation\n\nEDM is only used for parts whose designs demand tight tolerances, good surface finishes, undercuts, or other complex machining features. Some examples of where EDM is used include: cutting extrusions, rotary forms, or sharp internal corners, drilling micro holes or curved holes, engraving hard materials, or removing broken tools or fasteners from workpieces. \n\nEDM Vendor List\n\n\n\nVendor Name\n\nLocation\n\nPros\n\nCons \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStock Vendors \n\nInformation\n\n\tStock vendors sell stock in order to be machined, and do not do any machining. However, they typically have a large amount of inventory for extremely cheap prices. \n\nStock Vendor List\n\n\n\nVendor Name\n\nLocation\n\nPros\n\nCons \n\nMc-Master Carr\n\nUSA\n\nHas the most extensive catalogue of stock, with a variety of stock for machining, fasteners, and bearings. Ships extremely fast as well, with a turn around time of 1-2 days,  \n\nFor more niche stock, comparing cost with other vendors might be useful. \n\nSackin Metals\n\nUSA\n\nCheapest vendor of Titanium stock anywhere. \n\nUse of the machine shop and RPL is critical.",
    "How-To_ Make a DXF.txt": "How to make a DXF\n\n\n\nA DXF file (Drawing Exchange Format file) is a vector file that’s used to share drawing data between different applications. A DXF file is needed for the following 2D manufacturing methods: \n\nLaser cutting\n\nWater jetting\n\nFor more information on 2D manufacturing, see How-To: Design for different manufacturing methods. \n\n\n\nHow to make a DXF file in Fusion\n\nLet’s say I have this part that I would like to get manufactured from SendCutSend: \n\n\n\n\n\nMake a projected sketch\n\nClick on the face that the laser (or water jet) will be cutting into (i.e. the face with the important geometry). \n\n\n\nHit ‘Create Sketch’. \n\nHit ‘P’ on your keyboard to activate the ‘Project’ feature. \n\nClick on the same face you selected before and hit ‘OK’. \n\nYou should see a sketch of the face in purple. \n\n\n\nSelect ‘Finish Sketch’. \n\n\n\nIMPORTANT NOTE: Everywhere you see a purple line is where the laser (or water jet) will cut. If your sketch contains a line that goes through the part (like the picture below) then your part will be cut into 2 pieces! Always double check your sketch to make sure that it only contains lines that you want cut, and that it is not missing any important features. \n\n\n\n\n\nSave the sketch as a DXF\n\nRight click your sketch in the browser on the left. \n\nRename your sketch to ‘DXF’ so that others know what the sketch is for. \n\n\n\nRight click on ‘DXF’ and select ‘Save as DXF’.\n\n\n\nSave the sketch wherever you’d like with a name that makes sense. \n\n\n\nYou’re done!",
    "NHRL Builder Contacts.txt": "NHRL Discord\n\n\n\nBuilder\n\nArea of Expertise\n\nContact Method\n\nDetails\n\nJake Hoffman\n\nGeneral combat robotics design, metagame knowledge, Kinetic bots, 12lb category\n\nNHRL Discord\n\nBuilder of Maximizer\n\nBrian Boxell\n\nFlywheels, general combat robotics design, 3lb category\n\nNHRL Discord\n\n\n\nBusiness Cat\n\nSportsman robots, general combat robotics design, 12lb category\n\nNHRL Discord\n\nBuilder of Ram Plan\n\nBrandon Zalinsky\n\nSportsman robots, lifters, mecanum wheels\n\nNHRL discord (@mecanum_man)\n\nBuilder of Torquido",
    "How-To_ Battle Harden.txt": "How to battle harden your motors\n\n\tThis link leads to a video that gives a detailed video and an example for battle hardening. Battle hardening is the process of putting a glass microbe and epoxy mix between the magnets of motors so that the magnets will not shift and potentially shatter if the motor is hit.\n\nSAFETY: \n\nMake sure to wear a mask AT ALL TIMES when applying the glass microbe and epoxy mix. If you inhale a lot of the glass microbes you will get microplastics in your lungs and probably die from cancer :( \n\nWear gloves AT ALL TIMES when applying the glass microbe and epoxy mix. The stuff can get on your skin and it would be yucky because it would then become hard to peel off.\n\nWhen applying acetone, make sure that the cup you are putting the acetone in is resistant to acetone and will not get immediately melted. Acetone reacts with plastic and will literally melt through some cups so yeah.\n\nSTEP 1:\n\nTake apart each motor: The motors will have c-clips and shaft collars that will need to be taken off in order to pull apart the top and bottom in order to harden each piece. Another thing that will be on the motor is these golden ring things but you can just take those off and store them for later, they are basically just mini bearings for the motor. Be careful not to lose any parts!\n\nShaft collar:\n\nScrew these off using an appropriate allen key. If the screw is stripped and if you do not need the original shaft, you can use the drill press to take out the excess metal inside of the shaft collar. OR you can use the saw to saw off a large part of the shaft collar because the collar is made out of aluminum which is softer than steel.\n\nC-clips: \n\nWhen you take these off, make sure not to break them because it will be nice to have them later.\n\nSTEP 2:\n\nThe motor separated into top and bottom should look like the picture below:\n\nTOP:\n\n\n\nBOTTOM:\n\n\n\nMake the mixture: The video explains in a good way on how to measure out the mixture starting at 7:15.\n\nApply the mixture to the sections detailed in the video at 9:45. Make sure to quickly take off parts of the mixture before it dries so you save yourself some work scraping the rest off later on. The video goes into good detail so just watch that instead.\n\nSTEP 3:\n\nAfter the mixture has all been applied, all that is left is scraping the rest of the mixture off. Some useful methods are:\n\nUSE A BOXCUTTER to rub off excess material from the bottoms. This should be pretty easy, as all you have to do is find where the material is sticking out on the bottoms and cut it off.\n\nAPPLY ACETONE to the insides of the tops, especially because it is hard to get into the tops, especially with metal objects. A method that worked with us was to tape paper towels to the tips of popsicle sticks, and then dip it into the acetone and rub it on the magnets inside of the tops, but also make sure that you don’t get acetone in-between the magnets.\n\nSCRAPE WITH A FLATHEAD SCREWDRIVER the insides of the tops; this will take off lots of excess material easily, especially after acetone has been applied and all of the material is loosened. However, you might encounter a problem with the excess little bits and material that are in the tops.\n\nUSING DOUBLE SIDED TAPE TO TAKE THE BITS OFF works really well. You can get masking tape and shove it into the tops and rub it around which will catch all of the bits and take it off.\n\nSPINNING THE MOTOR. You can try to put together the tops and bottoms and spin the motor over and over again which will also gradually take off excess material. This will make bits of material that you can also take off using double sided tape.\n\nSTEP 4:\n\nRepeat and suffer\n\nSTEP 5: \n\nWhen the motors are fully battle hardened, compare them to a control group of motors. The battle hardened motors can be a little bit rougher than normal, but they should be relatively smooth as well. \n\nThey should look a little something like this:\n\n\n\nReference the video as well to see how a good battle hardened motor should look like.\n\nYou are done! Time for therapy. Here is a useful website for free therapy options offered by Cornell Health.",
    "How-To_ Program ESCs.txt": "How to program AM32 ESCs \n\nThis guide was written as a response to repeat robotics sending ESCs that were incorrectly configured. I (Jason) am unsure whether this guide is specific to the model of ESC we worked on. I think it should apply to all AM32 ESCs regardless. \n\nReflashing the Firmware\n\nRequired Materials: \n\n1 ESC with soldered power wires\n\n1 usb linker (USE THIS SPECIFIC ONE FOUND IN TEAM SUPPLIES, we’ve had trouble with other USB linkers not working) \n\n\n\n1 lipo battery\n\n1 usb c cable\n\n1 windows computer\n\n\n\nUnfortunately, this method only works with windows laptops due to the software required. \n\n\n\nMethod: \n\nDownload all the files from this drive folder. \n\nUnzip the file named “config tool.” \n\nNavigate to the .exe file named “SerialPortConnector.”\n\nRun the program.  \n\nIf you get a pop up like the following stating that the program might be dangerous, press the “more info” button and select “Run anyway.” \n\n\n\nThe program should look like the following. \n\n\n\nSelect the “Serial Port” dropdown and take note which COM Ports are present. There may be none depending on the computer used. \n\nPlug the USB linker into the PC using the usb c cable. \n\nPlug signal wires from the ESC into the usb linker. Make sure the black wire from the ESC corresponds to the ground pin on the usb linker. \n\n\n\nProvide power to the ESC by connecting it to the lipo battery. At this stage, the ESC should be connected to the PC via the USB linker and the battery. \n\nIn the settings tab on the ESC config tool, select the “Serial Port” dropdown and navigate to the COM port that is newly detected, compared to step 7. Check the “Direct Connect” box, and then press “Connect” to the right. \n\nFrom the newly shown options, click “M1”\n\n\n\nESC settings should populate (they won’t look the same as this)\n\n\n\nSelect the “Load Config File” button on the right hand side. \n\n\n\nNavigate to RepeatDrive_AM32.ecf and choose “Open.” \n\nPress “Save Settings” towards the bottom of the window. The top status window should change to “WRITE EEPROM SUCCESSFUL”\n\n\n\nPress M1 again to verify that the ESC settings are saved. It should show the below screen once again. \n\n\n\nPress “Close Connection” and unplug everything. \n\n\nHow to program ESCs using BlHeliSuite32\n\nThe Arduino Method\n\n\n\nVIDEOS AND DOCUMENTS REFERENCED:\n\nFlashing an ESC using an Arduino\n\nProgramming ESC using Software\n\nDetermining your ESC settings \n\n\n\nThis method requires the following materials: \n\n1 Arduino\n\n1 Arduino to USB cable \n\n1 ESC compatible with BlHeliSuite32 \n\n2 Wires/Jumper cables \n\n1 Laptop with a USB port\n\n1 Battery or power supply\n\n\n\nStep 1: Flashing the ESC\n\nDownload the required software from the following link (options for Windows/Mac/Linux are available):\n\nhttps://github.com/bitdump/BLHeli/releases \n\nUnzip the folder and run BLHeliSuite32\n\nClick on the Make Interfaces tab \n\nSelect the appropriate option from the Arduino Board dropdown\n\nFor this we are using Uno w/ ATmega328\n\nDo not change the Baud option, the default option should suffice\n\nClick the Arduino BlHeli Bootloader option\n\nUsing jumper cables, connect the black female wire of the ESC to the GND pin of the Arduino\n\nDepending on the Arduino board, connect the white female wire of the ESC to a numbered digital pin on the Arduino\n\nArduino Uno: digital pin 11\n\nArduino Nano: digital pin 2\n\nArduino Mega: digital pin 51\n\nConnect Arduino to computer via USB connector\n\nFor the Port option, click on the option that displays, should be something like “COM4USB2.0”, may not be exactly the same\n\nIf nothing shows up, may need to download Arduino software on your computer in order to install the necessary port drivers:\n\nhttps://support.arduino.cc/hc/en-us/articles/360019833020-Download-and-install-Arduino-IDE (Windows/Mac/Linux download)\n\nClick the Arduino BlHeli Bootloader button, then press Yes for the following popup\n\n\n\nStep 2: Programming the ESC \n\nConnect the Battery to the ESC\n\nSwitch to the ESC Setup Tab\n\nOn the Select BLHeli_32 Interface tap, click on BLHeli_32 Bootloader (USB/COM)\n\nEnsure the appropriate option for Port is selected\n\nClick on the Connect button\n\nThis should connect the ESC to the interface. If it fails to connect and states that “ESC is not connected to power”, use a multimeter to make sure current is flowing through the ESC and that all circuit components are soldered correctly. \n\nCustomize the ESC settings to fit your robot’s needs. Further detail on what each ESC setting means can be found here. \n\nOnce you are satisfied with your settings, click the Write Setup button. This will save all the settings onto the ESC.  \n\nIf you want to see the settings currently on the ESC, click the Read Setup button.\n\nIn the top-left corner, click the ESC Setup button, and then click Save setup to ini file. This will save your ESC settings as a file on your computer that you can upload to other ESCs.\n\nTo add ESC settings from an ini file to a new ESC, go to the top-left corner, click the ESC Setup button, and then click Read setup from ini file. \n\n\n\nAfter writing the setup, you are now done with programming your ESC!\n\n\n\n\n\n\n\n\nHow to program ESCs using VGood Programming Card \n\n\tThis is the VGood Programming Card, which allows you to program ESCs with BECs (Battery Elimination Circuits). To program ESCs using this card, plug your powered ESC into the PROGRAM plug on the top. The buttons will flash, which means the VGood card is connected to the ESC. Then. select the setting you want on the lit up row, and continue down the card until every setting is programmed. \n\n\n\nFor more information on each setting and its meaning, please refer to this YouTube video.",
    "How-To_ CAD in Fusion (Guidelines & Tips).txt": "How to CAD in Fusion: Guidelines and Tips\n\n\n\nThis guide will go over some tips and tricks to make sure that your CAD sketch, part, or assembly is super duper organized and easily accessible by other people. \n\n\n\nAnna Boese’s Number 1 CAD Tip: The shortcut ‘s’ will bring up a search bar where you can search any feature within Fusion (for example, Extrude, Mirror, Joint, etc). Use this before asking someone where to find something in Fusion! \n\n\n\nSketches\n\n\n\nWhy are my lines turning different colors and what do those colors mean? \n\n\n\nBlue: A blue line in your sketch means that the line (or shape) is unconstrained. This is what you will see when you first draw something in a sketch. \n\nUnconstrained or undefined means that that particular element in your sketch is free to move unpredictably. This is bad! You want all of your sketches to be fully defined so that they are not floating in space and so other people can understand why your sketch is shaped the way it is. \n\n\n\nBlue lines in Fusion. Note that there are two black lines, and those are defined by being coincident with the origin and being horizontal and vertical. \n\n\n\nBlack: A black line means that your sketch is defined or constrained using either the dimension tool or using other constraint methods, such as ‘coincident,’ ‘horizontal,’ or ‘collinear’ (as seen in the first picture below). This is good! You want all of your sketches to be fully constrained. \n\nSide note: If you apply a dimension and you get the error seen in the second picture (the one that says ‘over-constrained sketch’), that means that you’re trying to apply a dimension to a sketch that is already fully defined—aka, the dimension you’re adding is both unnecessary and impossible to apply. A driven dimension is simply a reference dimension that you can look at but cannot edit. \n\n\n\nConstraints listed in the bar at the top of your screen while in sketch mode. \n\n\n\nAn example of a pop-up you’ll get when you try to overconstrain a sketch. \n\n\n\nPurple: A purple line is a projected sketch. If you press ‘p’ on your keyboard while in sketch mode and select a face or a different sketch, then you can project an element onto your sketch plane. If the reference face or sketch updates, then your sketch should (typically) update with it. Be careful using projected sketches! If you then delete the reference face or sketch, then Fusion no longer knows where the projection came from, and you’ll get a bunch of yellow lines, which is bad!\n\n\n\nProjecting the face of a cube onto your sketch plane. \n\n\n\n\n\nThe resulting sketch in purple. \n\n\n\nYellow: A yellow line means that Fusion knows there is supposed to be a sketch element there, but it doesn’t know where it came from. This is typically a result of misusing a projected sketch. If you have any yellow elements in a sketch, you must redefine them! Yellow sketches are bad. \n\n\n\nThis sketch is yellow because I deleted the cube that the projected face was referenced from. \n\n\n\nGreen: A green sketch indicates that the sketch is fixed. Generally, this is bad because other users will not understand how your sketch is defined. There are two ways that your sketch can be green: \n\nYou manually fixed the sketch: This happens when you right-click an element of the sketch and hit ‘Fix/UnFix’. Once it is fixed, it will not move. \n\nYou redefine the sketch plane of a projected sketch: If your sketch contains a projection and then you redefine your sketch plane, the new sketch will turn your projection into a fixed sketch. If you do this, you should delete the sketch and re-project it so it turns purple. \n\n\n\nWhat are parameters and why should I use them? \n\n\n\nUnder Modify → Parameters, you can add User Parameters, which are variables that you can use when defining your sketches. \n\n\n\n\n\nAn example of a user parameter. \n\n\n\nWhen you make a sketch, you can then use this parameter as though entering a variable into an equation. \n\n\n\n\n\nAn example usage of a parameter. \n\n\n\nA dimension with an fx next to it means that it has been defined using a parameter. \n\n\n\n\n\nWhat a parameterized dimension looks like. \n\n\n\nSo why should I use parameters? \n\nParameters help people understand what your dimension means. Using the pulleyDiameter parameter will make more sense to someone looking at your sketch than just the number 2. \n\nParameters will make adjustments to your part file easy in the long run. If you have a parameter wheelDiameter that you use when defining your chassis, if the wheel diameter changes, you can easily change it in your parameters and you won’t have to individually change 200 different dimensions in a bunch of different sketches. \n\nOther tips on using parameters: \n\nYou don’t need a parameter for every single dimension. Be sure to use your parameters in an effective way that is easy to understand by someone looking at your part file. If it’s a one-time dimension, like a fillet, a parameter probably isn’t necessary. (But if you have a bunch of fillets that you want to be the same size, then it might be useful…)\n\nGive your parameters names that other people will understand! Diameter is not a useful name. weaponPulleyDiameter is a useful name. \n\n\n\n\n\nMy sketch is yellow in the timeline—what does this mean? \n\n\n\n\n\nAn example of a yellow sketch in a timeline.\t\n\n\n\nThis could mean 2 things:\n\nYou have a projected sketch but Fusion can no longer figure out where the sketch is projected from (see the explanation on yellow lines above). \n\nYou have to redefine your sketch plane, which is necessary if you drew your sketch on a surface that no longer exists. \n\nRight click the sketch in the timeline. \n\nHit ‘Redefine Sketch Plane.’ \n\nClick a new plane on which your sketch should reside. \n\nThis could be an XY plane, YZ plane, XZ plane, a face of a body, or a construction plane that you made yourself. \n\nThe yellow should be gone now!\n\n\n\n\n\nOrganizing a part file\n\n\n\nUsing the timeline\n\n\n\nThe timeline is the thing at the bottom of your screen: \n\n\n\n\n\nIt keeps track of the “operations” that occur in your part file, and the order in which it happens. \n\nThe gray bar that you see at the end of the timeline can be moved so you can essentially reverse time. This is useful if you realize that you need to do an operation before another operation (for example, adding a construction plane to use for the mirror operator). \n\n\n\nOrganizing your timeline into groups\n\nYou can organize your timeline into groups: \n\nSelect a bunch of operations with ctrl → right click → hit ‘Create Group’\n\nYou can then rename this group into something useful. \n\nSome examples of useful groups: \n\nFillet groups\n\nJoint groups\n\nHole groups\n\nCaveat: Unfortunately, there is no way to add a new operation to an existing group. The only way to do this is to delete your previous group and make a new group with the new feature. \n\n\n\nCapture design history\n\nWhen you upload a part into Fusion (from McMaster, maybe), it will not have a timeline. To ensure that you have a timeline before making changes to the parts: \n\nRight click the part name in the browser. \n\n\n\nSelect 'Capture Design History’ at the bottom. \n\nNow you can begin editing! (If you want to.)\n\n\n\n\n\nLabeling your sketches\n\nDO IT! \n\nLabeling your sketches is essential for organization. It is helpful for you to remember when, where, and how you’ve defined your part, and it’s helpful to others who are trying to understand you CADding process. \n\nTo label your sketch: \n\nRight click your sketch in the browser. \n\nHit ‘Rename’. \n\n\n\n\n\n\n\nOrganizing an assembly\n\nWhat is a component? \n\nA component is a fancy word for a part. It can come from a variety of places: \n\nYou can insert a component from a part you made by right-clicking the part in the Data Panel (the place where the files are) and clicking ‘Insert into Current Design’. \n\nIt is not recommended that you edit the part in this assembly file! This is called editing in place, and it makes it extremely difficult for other people to understand how you constructed your part. You should only edit parts in your part files. \n\nYou can import a part from McMaster by downloading the file from the website, uploading it to Fusion, and inserting it into your design as described in the previous point. \n\n(It is possible to directly import a McMaster part from Fusion, but this is not recommended since it creates a base feature and you are unable to rename the part or easily use it in other files.)\n\nYou can create a component by selecting Create → New Component. \n\nA good example of using this feature is in the ‘Chassis Assembly’ in Benjamin Rimshot Johm, Esq.\n\nThis allows you to create your parts in the same file without having separate part files that are then inserted into the assembly. \n\nTo edit this component, make sure that it is activated in the browser by clicking the dot next to the component (see the picture below). \n\n\n\n\n\nAn activated component in an assembly. \n\n\n\nHow many assemblies, subassemblies, subsubassemblies, etc. should I have? \n\n\n\nA part file contains only the part and no components. \n\nThis is where editing should take place. \n\n\n\n\n\nA part file contains no components in the browser. \n\n\n\nAn assembly file should generally only contain components. \n\nYou should generally not make any edits to parts in an assembly file. \n\n(There are some exceptions to this rule. See ‘Chassis Assembly’ in Benjamin Rimshot Johm, Esq. for an example.) \n\nYou should label your assembly as ‘Assembly’ in the file name so other people know that it’s an assembly (Fusion does not differentiate automatically between part files and assembly files.) \n\nUse sub-assemblies with care; do not make unnecessary sub-assembles. Having 1 sub-assembly per subsystem is typical. \n\n\n\n\n\nAn assembly file contains only components in the browser. \n\n\n\n\n\nHere’s an example of part organization for a kinetic robot: \n\nFull assembly (contains components only)\n\nChassis assembly (contains components only, with exceptions)\n\nBillet\n\nUprights\n\nTop plate\n\nChassis screws\n\nEtc. \n\nDrivetain assembly\n\nWheel\n\nMotor\n\nGearbox\n\nPulley\n\nSpacers\n\nDrivetrain screws\n\nEtc. \n\nWeapon assembly\n\nWeapon blade\n\nWeapon shaft\n\nBearings\n\nSpacers\n\nPulleys\n\nEtc. \n\nBattery\n\nESCs\n\nWeapon motor (if not a hub motor)\n\nInter-subsystem screws\n\nConfigurations\n\n\n\nWhat is a joint and how do I use one properly? \n\n\n\nA joint positions components relative to each other in an assembly.\n\nTo joint components:\n\nMake sure they are components not bodies!\n\nClick the joint button in Assemble (or press “J”)\n\n\n\n\n\n\n\nSelect the place you want to join on the first component\n\n\n\n\n\nSelect the place you want to join on the second component\n\n\n\n\n\n\n\nClick “OK” (or press “Enter”)\n\n\n\n\n\nMake sure to name the joint!\n\nClick the folder “Joints”\n\nDouble click the joint and name it according to naming convention\n\n[Name of component 1] to [name of component 2]\n\n\n\n\n\n\n\nI have so many screws and small parts! How should I organize this?",
    "How-To_ Preload (for Spinning Weapon Assemblies).txt": "How to preload (for spinning weapons)\n\n\n\nProper preloading is an essential step when designing and assembling spinning weapons: with the right preload, a weapon stack can spin freely while remaining very strong against impacts. When the preload is too tight, the weapon doesn’t spin freely, and when the preload is too loose, the bearings can shake themselves apart.\n\n\n\nThis preloading guide applies only to spinning weapons that rotate around stationary (“dead”) shafts, which are typically steel bolts. If you’re designing or working with a different kind of spinning weapon, preloading may still be important, but you’ll need to do more research to make sure you’re applying it in the right way. Additionally, preloading is not essential for all bearing types, but for angular-contact bearings (ACBs), it is essential. This guide focuses on preloading with ACBs, using Rosie’s weapon assembly as an example (labeled in the figure below).\n\n\n\n\n\nBut what is preloading anyway?\n\nA bearing is preloaded when there is a constant axial load applied to it by the assembly, as shown below. F1 is applied to the outer race, and F2 is applied to the inner race, forcing those races towards each other to keep the balls from being able to rattle. For ACBs like this, it’s possible for the bearing to rattle itself apart at high speeds if there is no preload. \n\n\n\nHowever, too much preload can cause the bearing to seize up. If F1 and F2 are too large, the balls and the races will be squeezed tightly, forcing them to deform as they rotate. This causes unnecessary wear, and at high speeds, it can create enough heat to melt the plastic holder that keeps the balls in place. So we want to get F1 and F2 (the preload force) just right.\n\nHow do we get the preload force just right?\n\nShort answer: by sandwiching them with perfectly sized spacers. To see what this means, let’s look at a cross section of the complete weapon assembly. The bolt’s head and the nut squeeze the assembly, and the small purple arrows show the force propagating toward the central area between the two ACBs.\n\n\n\n\n\n\n\nAnalyzing this from the left end to the center:\n\nThe bolt head (red) pushes inward on the chassis plate (red outline).\n\nThe chassis plate pushes on a spacer (yellow).\n\nThe spacer pushes on the inner race of the LEFT ACB (orange).\n\nThe ACB pushes on two things:\n\nThe preload spacer (red)\n\nThe force travels directly through the inner race.\n\nThe weapon blade/pulley assembly (cyan/green)\n\nThe force travels from the ACB’s inner race through the balls and outer race before actually pushing on the weapon blade.\n\nAnalyzing this from the right end to the center:\n\nThe nut (blue) pushes on the chassis plate (red outline).\n\nThe chassis plate pushes on a spacer (yellow).\n\nThe spacer pushes on the inner race of the RIGHT ACB (orange).\n\nThe ACB pushes on two things:\n\nThe preload spacer (red)\n\nThe force travels directly through the inner race.\n\nThe weapon blade/pulley assembly (cyan/green)\n\nThe force travels from the ACB’s inner race through the balls and outer race before actually pushing on the weapon pulley.\n\n\n\nFrom these analyses, we can see there are two things being compressed in the center:\n\nThe central spacer, between the inner races (length A)\n\nThe weapon blade/pulley, between the outer races (length B)\n\nIf A is shorter than B, then when the nut is tightened, the force will travel through the balls and outer race of the bearing (this is a preload). If A is longer than B, then when the nut is tightened, the force will only go through the preload spacer (the balls will be loose; there is no preload).\n\n\n\nThis leaves us with two ways to adjust the preload on a weapon assembly:\n\nBy tightening or loosening the nut: this changes the total compressive load through the system, and it’s very easy to adjust without disassembling anything. However, loosening the nut too much can weaken the system overall, and no human can tighten it beyond a certain point.\n\nBy changing the length of the preload spacer: since the metal parts compress slightly, it’s possible to distribute the load between the preload spacer and the balls of the ACBs. By tweaking the length, we can put 80% of the load through the preload spacer and 20% of the load through the balls. This lets us tighten the nut more, keeping the assembly strong without applying too much preload to the ACBs.\n\nHow do you change the length of the preload spacer without re-manufacturing it? By adding or removing shims. Shims are like extremely thin washers with precise thicknesses, and you can add them between the preload spacer and the inner race of an ACB. This is often tricky and fiddly to do, because the spacer is (and must be) in the center of the weapon assembly.\n\nSuper fun exercise that will haunt you until you figure it out\n\nNow that you understand the principles of preloading, try analyzing the forces in Beater B. Barker’s weapon/flywheel assembly. This one has two pairs of ACBs, so it’s twice as fun!\n\n\n\nTake a screenshot of the cross section below and draw out the little force arrows. Can you find the preload spacer here? Where would you add shims?",
    "How-To_ Choose ESCs.txt": "How to choose ESCs\n\n\n\nPrerequisites\n\nYou will need 1 ESC per motor. In order to choose your ESC, you need to know which motors you are using. \n\n\n\nChoosing an ESC\n\nYour motor should have a maximum continuous current rating. Find it. (For example, this motor has a max continuous current of 35A.)\n\nFind an ESC (preferably not from eBay) that has an amperage rating that is at least this value. \n\nFor the example above, you would want a 35A ESC or greater. \\\n\nMake sure that the S rating is the same as your battery. \n\nMake sure that it’s compatible with your motor type (brushed or brushless). \n\nThat’s literally it. \n\n\n\nBidirectionality\n\nIf this ESC is for your drivetrain, you must make sure that your ESC is bidirectional. If it is not explicitly stated as bidirectional, it is not recommended that you order it. \n\nIf it’s not bidirectional, you will not be able to drive backwards. \n\nFor your weapon, this might be something to keep in mind, but may not be a requirement. \n\nFor example, most spinning weapons only need to go in 1 direction. Lifters, however, may need to move in both directions in a controlled manner.",
    "How-To_ Take Care of Your LiPo Battery.txt": "How to take care of your LiPo battery\n\nSafety guidelines\n\nDo not charge a LiPo cell above 4.2 V. This can cause the battery to set on fire. \n\nLiPo cells are permanently and irreparably damaged if discharged below about 2.8 V per cell.\n\nBecause LiPo batteries can be unstable, it is important to always store them in LiPo bags and watch the battery when charging them. Give it a poke every once and a while to make sure it’s not heating up too much. \n\nAlways discard a LiPo battery that exhibits early signs of damage, such as “puffy” swelling of the wrapping. \n\nNever use any charger except for a charger specifically designed for LiPo batteries. \n\nIt is best to charge your battery out of the robot and in a charging bag. \n\nCharging your battery inside the robot is fine for a few charge cycles (for example, in between matches at competition) but over time it may allow the charge state of individual battery cells to drift from optimum. \n\nIf your battery catches on fire, back away and leave it in the LiPo bag if it is already in a bag. Grab the fire extinguisher by CMR’s table or the sand and use it to extinguish the fire. Sand will also work if a fire extinguisher is not available. Do not use water on a LiPo fire!!!\n\nHow to charge your LiPo battery\n\nAlways make sure that the black wire goes to the black wire, and the red wire goes to the red wire. \n\nPlug the main connector of your battery into the battery charger (this connector is most likely a yellow XT60). \n\nPlug in the balance port to the charger. This is the smaller white connector.\n\nThere are different connectors depending on how many cells your battery has. Make sure you plug in the correct one (for example, a 6S battery should plug into the 6S port). \n\nThe balance port makes sure that all of the cells in your battery charge equally, which will prolong the life of your battery. \n\nThe amperage setting on your charger should be the following: \n\nIf your battery is 4200 mAh, you should charge at 4.2 A. If your battery is 2400 mAh, you should charge at 2.4 A, etc. \n\nThe voltage setting on your charger should be the following:\n\nYour battery might have the voltage written directly on it. If there is no voltage, you can calculate the voltage using the following: Voltage = 3.8 * number of cells\n\nFor example, for a 2S battery, your voltage setting should be 7.6V (or 3.8*2)\n\nHold down the charge button.\n\nConfirm your settings. \n\nYour battery should now be charging!\n\n\n\nWhat Constitutes a Damaged Battery?\n\nAny battery that has excessive swelling, or loses it’s distinct rectangular shape.\n\nAt competition, if something indents a battery or damages it in any way beyond the most superficial impacts, you should refrain from using or charging the battery at all costs! If charged or used further, this can cause a fire. AT NRHL, A FIRE IN THE PITS WILL DISQUALIFY THE BOT IMMEDIATELY! DON'T TAKE THE RISK! A fire in the cage will lead to the entire robot getting thrown in the trash, and they will not give you access to it for a long time to make sure it will not explode or set on fire again. DON’T TAKE THE RISK!!!\n\nHow to Dispose of a Damaged LiPO/LiHV Battery\n\nIn a plastic container, dissolve ½ cup of salt in 1 gallon of cold water. \n\nDrop the battery into the salt water and leave it there for at least 2 weeks. \n\nRemove the battery, wrap it in paper, and throw it in the trash.\n\nRestoring Over-Discharged LiPos:\n\nStep 1: Initial Restoration Phase (LiPo < 3.3V/cell)\n\n\tWarning: While LiPos are <3.3V/cell, do NOT leave unattended. Constantly monitor through touching batteries to ensure they do not get hot and making sure the battery is not puffing. Always charge batteries in a LiPo bag. NiMh chargers do not detect end-of-charge, so if left unattended LiPo battery will catch fire. \n\n\n\nUse NiMh BATT charger setting (without the balance board connected) with 0.1A until the battery reaches 3.3V * #cells in charge. \n\nFor 6S battery- 19.8V\n\nFor 4S battery- 13.2V\n\n\n\nFig 1: Step 1, Initial Restoration Phase.\n\n\n\nFig 2: Photo of charger settings, Step 1.\n\n\n\nStep 2: Post-Restoration Phase (LiPo > 3.3V/cell)\n\nWarning: Charge within LiPo battery bag. Always watch the battery while charging. Do not charge to 100% charge, in order to avoid battery damage. \n\nCharge anywhere between 0.5C and 1C on LIPO BATT mode. The lower the capacitance, the slower the batter will charge, but the safer it will be. Do not exceed 1C.\n\nExample: 1300 mAh 4S (14.8V) battery\n\n1C- Charge at 1.3A\n\n0.5C- Charge at 0.65A\n\nContinue watching the batter as it charges, unplugging as it approaches max \n\n\n\n\n\nLiHV Batteries:\n\nLiHV batteries are essentially LiPO batteries, but with a slightly higher voltage, hence the HV meaning High Voltage. For most cases, they can be treated the same as LiPO batteries, however, their maximum voltage is 4.35 Volts per cell, as opposed to 4.2.\n\nYou can adjust this by pressing the cycle button when LiPO is flashing on the charger screen, and selecting LiHV instead.\n\nLiHV batteries can still be charged at 4.2 Volts per cell, they will just hold less power than they could.\n\nNOTE: SMC Racing will make custom batteries if you email orders@smc-racing.com\n\nThis includes LiHV and LiPO batteries, how custom is custom is yet to be determined (we should email and talk)",
    "How-to_ Bend Titanium Wedges.txt": "How to bend titanium wedges\n\nNotes about titanium bending\n\nIn order to achieve a certain bend angle, you have to overshoot your goal angle by about 15°. From there, the titanium will bend backward to the spot that you want it to be in. \n\nTitanium will break if you try to bend it to about 45°. Be sure to follow the procedure below carefully. \n\nThe procedure outlined in Step 4 below will increase the bend radius, therefore making the plate less susceptible to breaking. (Bigger radius = less stress concentration—remember statics?)\n\nProcedure\n\nAll sheet metal bending is done using the sheet metal bender in the Emerson machine shop, which is to your left when you enter the shop.\n\nClamp your titanium plate onto the machine. \n\nFor bends smaller than 45°:\n\nBend to whatever angle you want + about 15 extra degrees. \n\nDone!\n\nFor bends at or greater than 45°:\n\nBend titanium to no more than 55°.\n\nUnclamp and pull the titanium out a few millimeters. \n\nRe-clampe the plate and bend again.\n\nRepeat until the desired angle is achieved. \n\nDone!",
    "How-To_ Machine (Guidelines & Tips).txt": "How to machine\n\nThe basics\n\n\tThis link leads to videos that explains how to use the basic functions of the manual mill and manual lathe, along with other machinery like the belt sander and the horizontal bandsaw. Instead of me explaining how to machine, watch these videos; if you’re looking for information about a specific operation (i.e. tapping), open the video and refer to the timestamps in the first few seconds of the video. If a commonly used operation is not explained in these videos, it will be explained in this section. \n\nThe Cornell Official Emerson Machining Manual also has a lot of information that may be useful. \n\nHow to zero the z-axis on the manual mill\n\nNOTE that every single time you change your tool, you have to re-zero your z-axis! So adjust your order of operations accordingly…\n\nFind the shim paper hiding around the shop somewhere—it looks like the picture below. (It looks like tissue paper, but it’s shiny.) Alternatively, if you can’t find shim paper, you can use your part drawing. \n\n\t\n\nUsing the rough z-axis adjuster that is at eye-level, position your part so it is sort-of close to your tool. The precise z-axis is a pain to move, so you’ll be happier the less you’ll have to move it. \n\nLOCK THE ROUGH Z-AXIS by turning the little knob that’s near the big handle (see the figure below). You do not want this to move from here on out, otherwise you’ll lose your zero!\n\n\n\nPut your shim paper/part drawing between your part and the tool. Slowly move the precise z-axis (henceforth just known as the z-axis) upward while wiggling your paper simultaneously. The moment the paper gets snagged by the tool and stops moving, don’t move the z-axis anymore!\n\nZero the z-axis by loosening the grippy part of the handle and rotating the marker part of the handle until the number ‘0’ lines up with the small line. Then, re-tighten the grippy part. (By grippy part, I mean the round part that feels like it has a lot of grip.)\n\n\t\t\n\nIf you need your depth to be extra precise, offset your z-axis by the thickness of your paper. You can measure this thickness using calipers. (The shim paper is 0.001” thick.)\n\nYou have now zeroed your z-axis! Congrats! Remember that each line on your z-axis handle is 0.001” and there are 100 marks per rotation—therefore, 1 full rotation of the z-axis handle is 0.1”.\n\nIf your depth is 0.5”, rotate the handle 5 times.\n\nEtc etc etc…\n\n\n\nHow to drill off-center holes in a circle\n\n\tFor example:\n\n\n\n\tSince the lathe only drills center holes, you’ll need to use the mill. Follow the steps below:\n\nFind a v-block that fits around your part such that the circle is clamped between the v-block and the vise, as shown in the picture below. The part should be resting on parallels, as always. Make sure your part is sticking above the v-block and the vise so you have material you can zero off of. \n\n\t\tINSERT A PICTURE HERE\n\nSet up the wiggler tool for zeroing. \n\nFor the following step, do not adjust the y-axis!\n\nTouch the wiggler to one side of the circle as you would normally. Zero this side. \n\nMove the wiggler to the other side without touching the y-axis and touch the wiggler to the other side. DO NOT ZERO. Instead, hit the center-line button (which looks like the picture below) and then hit ‘X.’\n\n\n\nThe x-axis is now zeroed on the center of your part. Repeat step 3 for the y-axis by using the wiggler tool on the top and bottom of the part without moving the x-axis!\n\nThe mill is now zeroed in the center of your part. From here, you can drill all your holes. Hopefully the hole placements in your part drawing are defined using ordinate dimensions from the center! 😀\n\n\n\nHow to machine plastic\n\n\tDON’T \n\nCommon issues\n\nMy tap broke!\n\nOopsie! That sucks. Unfortunately, this probably means that your part is no longer usable (though this may vary on a case-by-case basis). Since the tap is made of a much harder metal than your drill bits, there’s no way to drill through it. You may now take this part home and put it on your wall of failures. \n\nThere are 4 common culprits that lead to tap breaking:\n\nYou used too much pressure: When you tap a hole, you should not be pushing downward at all. If you have to use force to get your tap to cut threads, then something is wrong. The only force you should apply is horizontal to twist the tap in a circle. \n\nYou used too much torque: Try not to use a tap handle that is way too big for the hole you’re tapping. There’s no real metric for this, just try to find a tap handle that feels right. If you use one that’s way too big, there’s a bigger chance that small errors can cause your tap to break (like not being completely aligned or hitting the bottom of the hole). \n\nYou continued tapping even when you reached the bottom of the hole: This aligns with #1. Do not use force to go down! When you reach the bottom of the hole or feel any resistance, stop. If you use a “bottoming tap” (which looks like the first picture) as opposed to a “taper tap” (which looks like the second picture) then when you hit the bottom of the hole, your tap will stop instantly.\n\n\t\t\t\n\n\n\nYour tap wasn’t straight: This usually happens if you’re tapping by hand (which is a bit risky, and I don’t recommend it). If you absolutely must tap by hand, always have someone else watching you from multiple angles to make sure you’re tapping straight. \n\n\n\nMy parallels keep moving and I can’t get them to stay still!\n\n\t\tThis could be for a bunch of reasons. I’ll list a few below:\n\nYour part isn’t square! If it’s not sitting flat against the parallels, it’ll look like the picture below. If possible, try to choose an orientation that consists of the 3 most square sides of your stock so it fits nicely, like the second picture. If there are no 3 sides that are square enough, you’ll have to face one side of your stock, rotate, face another side, rotate again, face a 3rd side, and repeat this process until your part is square enough to secure those parallels. \n\n\t\n\n\n\nYou didn’t mess with it enough! Sometimes it just takes some wiggling. Something I like to do (which usually works) is press my hand down on the part while I tighten the vise, which helps to secure it a bit better before I use the mallet and then tighten again. \n\nYou didn’t whack it with the hammer hard enough! Give it a really good smack. Don’t be shy, you know you want to. Make sure to smack it when it’s secure in the vise—if you hit it and it’s not secure, it’ll just go flying (or make a really loud noise). \n\n\n\nI turned on the machine and it made a really loud and scary noise!\n\n\tThis is probably because your machine—whether you’re using a lathe or a mill—wasn’t\n\n in gear. It’s similar to a bike—if you change gears but the chain slips or gets stuck, no more bike riding for you. \n\n\tOn the mill, there is a small lever that you move if you want to shift from high range to low range. If you don't move the lever all the way to one side, your mill will make a terrible noise. Make sure the lever is all the way to one side—if it’s stuck, spin the collet holder in circles until it moves. Spinning the collet holder will shift the gears inside the mill until they align. If you’re spinning and the gear still isn’t locking it into place, try putting it back into the other gear, running it for a few seconds, turning it off, and then trying again. \n\n\n\nOn the lathe, it’s a similar issue—you’re probably stuck in-between RPM ranges. Make sure the lever is completely on a single RPM range—if it’s stuck, put the lathe in neutral (by shifting the “on” lever to its middle position) and spin the lathe chuck until the lever clicks into place. \n\nFeeds, Speeds, and Step Sizes\n\n\tThis video explains how to calculate RPM based on your tool, part size, and material. The details of this video are summarized below. \n\n\n\n\n\n\n\n\tSFM values can be found in the table below. \n\nFor a mill, the “Diameter” is the size of the cutter (drill bit). On the lathe, “Diameter” refers to the size of the stock if you’re cutting the outside; if you’re boring or drilling a hole, “Diameter” will be the size of the hole. \n\n\tThe constant 3.82 is 12/π; it converts surface feet into surface inches. For manual machines, you can replace the 3.82 with the number 4 to make calculations easier. Manual machines will most likely not have the exact RPM value you need, but this formula will give you a good range. Based on what the machine provides, always choose a number under your calculated RPM. \n\n\n\n\tThe SFM table below is based on high-speed steel (HSS) tools. For carbide tools, you can double these numbers. If you’re not sure what type of tool you have, assume it is an HSS tool. \n\n\n\nSFM Values for Various Materials\n\n\n\nMild steel (i.e. any steel that has not been hardened)\n\n90\n\nTool steel\n\n50\n\nMystery steel (i.e. steel stock that you found, but you’re unsure of the alloy or treatment)\n\n50\n\nHardened steel\n\n50\n\nAluminum\n\n150\n\nBrass\n\n150\n\nBronze\n\n100\n\nStainless steel\n\n40\n\n\n\nThe following quick guide is for use with the manual machines in Emerson. For any other operation requiring any other tool, refer to the calculations above. \n\n\n\nRPM Quick Reference for Aluminum Only\n\n\n\nMachine\n\nTool/Operation\n\nRPM\n\nStep Size [inches]\n\nManual lathe\n\nTurning/facing tool\n\n630\n\n0.05\n\nManual lathe\n\nBoring bar\n\n630\n\n~0.005 (depends on project needs)\n\nManual lathe\n\nCutoff tool\n\n125\n\nSlow\n\nManual mill\n\nMilling/facing\n\n850-1000\n\n0.03\n\nAny\n\nDrilling, for bits up to ½” in diameter\n\n850-1000\n\nN/A (Utilize peck drilling)\n\nAny\n\nDrilling, for bits ½” diameter and above\n\n~200\n\nN/A (Utilize peck drilling)",
    "How-To_ Choose a Battery.txt": "How to choose a battery\n\nReference the Technical Glossary for more info on S-ratings, C-ratings, etc. \n\n\n\nWhy LiPo batteries?\n\nHigh energy density (more energy per cell compared to, say, NiCd batteries). \n\nWeight efficient. \n\n\n\nHow to pick a battery for your robot\n\nGoverning equation\n\nCurrent [A] * Time [h] = Capacity [Ah]\n\nCurrent: Total current that the battery needs to supply. \n\nTime: The amount of time that the battery will need to supply the current. (For NHRL matches, this is a maximum of 3 minutes.) \n\n*Don’t forget to convert to mAh*\n\n\n\nMethods for picking your battery\n\n*Choosing a battery is the last electronic piece that should be chosen (except for the wires, which are really the last thing)*\n\n\n\nMethod 1: Use the equation above. Sum the maximum continuous current for each motor to determine the “motor current.”\n\nGood because: You can determine which battery you want before you test it, and you’ll have a large factor of safety. \n\nBad because: This will result in a far higher capacity than you realistically need, since the maximum current is rarely met, typically only for brief moments while spinning up, or when it is stalling due to high torque loads on the weapon (for instance, if you try to spin up against a wall). \n\nMethod 2: Manually test and measure current draw. \n\nGood because: It will give you a more accurate estimate that takes into account friction and air resistance. \n\nBad because: You need to have the entire robot assembled to test this, and you need a method to measure the current in your bot. \n\nMethod 3: Find a robot similar to yours and use their battery. This reference sheet may be helpful. \n\nGood because: Other builders have already tried and tested it, so you don’t have to. And there is some amount of proof that it will work. \n\nBad because: It’s a little iffy. You have to be okay with some hand-wavy reasoning. \n\nMethod 4: For the weapon motor current, use this spreadsheet. \n\nGood because: It will give you a better estimate of current draw for your weapon motor. \n\nBad because: You need to find the drag coefficient somehow…",
    "How-To_ Torch Braze Aluminum_.txt": "How to torch braze aluminum\n\nHelpful Video\n\nThis video will explain everything you need to know, but if you’re too lazy to watch it, you can read the directions below. \n\nMaterials\n\nYou can get all of these materials at Home Depot or Amazon:\n\nPropane Torch \n\nTorch Trigger\n\nAluminum brazing and welding rods\n\nAluminum Tubing\n\nSteps\n\n*Note: When brazing, the filler rod will always flow towards the heat. Had you clamped your setup vertically and gotten the joint a fair bit hotter, you could have drawn the molten filler towards the torch. could make for a significantly stronger joint.\n\n\n\n*Note: For better results, work on a ceramic topped table with a ceramic tile behind the metal you're working on. Try to place ceramic on the sides also. This will reflect a good portion of heat which will otherwise dissipate very quickly.\n\n\n\nChamfer the ends of the aluminum where you are going to bond it (to allow a channel for the braising material)\n\nClean the aluminum with a brush\n\nClamp up the tubing\n\nStart heating the intended area with the propane torch (get it to around 700 degrees)\n\nThis may take 4-5 minutes\n\nWe want it hot enough to melt the brazing rod but not the aluminum\n\nWhen you think you’ve reached that point start moving the rod down the chamfered channel and when it starts to melt you are hot enough \n\nRub the brazing rod until its filled in then finish off with some heat\n\nRepeat process on all sides of the aluminum joint\n\nAdditional resources\n\nWorking with braze aluminum\n\n\n\nWiki-How",
    "How-To_ Design an Asymmetric Spinning Weapon.txt": "How to design an asymmetric spinning weapon\n\n\n\nAn asymmetric weapon can achieve twice the bite depth as a symmetric weapon at the same RPM. This is helpful for being extra destructive in the box. But it can be tricky to design one, because you have to make sure it spins about its center of mass (CM). In a symmetric weapon, you can just put the bearing hole in the visual center of the part, but you can’t do that when you go asymmetric. This guide explains how to design an asymmetric weapon, including a nice way to get Fusion to automatically position the hole.\n\nPrerequisites\n\nIf you have a basic understanding of parameters and are good at making fully constrained sketches in Fusion, this should be relatively straightforward.\n\nOverview\n\nThis guide shows you how to do the following:\n\nSet up a new Fusion file with a point that is positioned based on specifically defined user parameters. This will be the point you reference in any features that need to follow the CM.\n\nInstall a script that updates the CM parameters to match the coordinates of the actual center of mass.\n\nSketch a rough version of the weapon profile, keeping it simple and anchored to the origin, and include a bearing hole anchored to the CM point. Extrude the profile to create a body with a center of mass.\n\nRun the script and verify/debug the model as you adjust your design.\n\nStep 1: Set up the Fusion file\n\nIn order for later steps to work properly, you need to create a new Fusion design file with nothing else in it. First, create five user parameters with these exact names and units:\n\nCM_x (units: cm)\n\nCM_y (units: cm)\n\nCM_z (units: cm)\n\nCM_inaccuracy (units: cm)\n\nCM_iterations (no units)\n\nThe script won’t work properly unless all five parameters exist and are exactly as shown above. You’ll have to provide a value for each one as you create it, but these initial values don’t matter to the script, so do something like this to keep it from overlapping with the origin point:\n\nCM_x = 1\n\nCM_y = 2\n\nCM_z = 3\n\nCM_inaccuracy = 0\n\nCM_iterations = 0\n\nNow that you have the parameters, create a point that follows them (the CM point). Make three Offset Planes defined using the parameters:\n\n\n\n\n\n\n\n\n\n\n\nThen define the point as an intersection of those planes:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThen you can hide the planes and rename your point, like this:\n\n\n\nNow you can project this point into any sketches you make.\n\nStep 2: Install the script to make the CM point actually follow the CM\n\nFusion lets you write custom scripts in Python or C++, which can interact with Fusion in many ways. The script you’ll use looks up the center of mass of the file and writes its XYZ coordinates to CM_x, CM_y, and CM_z (but only if these parameters already exist—you’ll get an error if they don’t). The script is available in a zip file: CenterOfMassParameters.zip.\n\n\n\nInstall the script by downloading the zip file and moving it to...\n\non Windows: %AppData%\\Autodesk\\Autodesk Fusion 360\\API\\Scripts\n\non Mac: ~/Library/Application Support/Autodesk/Autodesk Fusion/API/Scripts\n\nThen extract it there. It should end up in its own folder called CenterOfMassParameters.\n\nStep 3: Sketch and extrude the weapon blade\n\nOnce you know what general shape you want out of the weapon, you can sketch it on one of the origin planes. To keep the profile stable when the script updates the center of mass, you should constrain at least one major feature at the origin. Otherwise, feel free to constrain features to the CM point and each other—just keep things simple so you can fix it if something goes wrong during a center-of-mass update.\n\n\n\nHaving sketched the profile, extrude it to create a body that has a center of mass. The script won’t work unless there’s a body in the file.\n\n\n\nNote: you can add other parts to the file if, for example, you want the weapon shape to account for the weight of an off-center screw. Just make sure every part (including the weapon blade itself) is the right material/density/weight.\n\nStep 4: Run the script and verify the results\n\nOnce you have the script installed, you can access it through the menu shown in the picture below, or by pressing Shift+S and running CenterOfMassParameters. Fusion should find the script automatically when you open the Scripts and Add-Ins dialogue, but if CenterOfMassParameters doesn’t show up, try restarting Fusion.\n\n\n\n\n\nSince you’ve set up the document well in step 1, you should be able to just run the script by clicking on it and clicking Run. This will update CM_x, CM_y, and CM_z to match the actual center of mass of the part.\n\n\n\nThis script iterates for you, and here’s why: if you’ve dimensioned any features based on the center-of-mass point you made, those features will move each time the script updates the center of mass. This, in turn, will change the object’s center of mass. To deal with this, the script runs iterations of this process until either:\n\nThe CM moves less than 0.01 cm from the last iteration, or\n\nIt runs 50 iterations. If this happens, you need to change (most likely simplify) your design to make the iterative process converge.\n\nYou can tweak the tolerance and max iteration count by editing the code and saving.\n\nImportant: check that the script is working properly!\n\nThere’s always a chance something has changed about Fusion’s API, or that something about your file is tripping up the script and giving incorrect results. You can check for this by showing the center of mass point in a way that doesn’t rely on the script.\n\n\n\nYou can find an option to display the center of mass in the Utilities tab, Inspect menu, as shown below. Unexpectedly, this non-selectable display object will only update when you orbit your view around the part. Make sure to orbit frequently when checking for discrepancies.",
    "How-To_ Pick Fits and Tolerances.txt": "How to pick tolerances\n\n\n\nPerhaps put a little blurb here explaining why this document exists, or any other references that people can refer to. \n\n\n\nHeading 1\n\nYour very first section! Congrats! Make sure to include pictures and be as specific as possible while not over-blabbing. (By the way, make sure to tell Anna you’re writing this so she can proof-read it when you’re done!)\n\n\n\nAlso, try to not use paragraphs as much as possible. \n\nThe easier it is to read, the more likely someone will be to read it. \n\n\n\nSubheading\n\nYou may or may not need this, but here it is just in case. \n\nIf you’re listing steps\n\nto do something, \n\nthen maybe using a \n\nnumbered list\n\nmight be helpful!\n\nMaybe even substeps too…\n\n\n\nHeading 2\n\nIn case you need another one…who knows!\n\n\n\n\n\nSLIP FIT- WITHIN 1 THOU ON GREATER END OF BEARING SIZE GIVEN BEARING TOLERANCE\n\n\tSmaller bearing- 1 thou may be too large\n\n\tLower limit: largest bearing size, Highest limit: 1 thou above that \n\nPress fit if you are comfortable with part never coming again\n\n\n\nhttps://amesweb.info/fits-tolerances/tolerance-calculator.aspx",
    "How-To_ Design a Chassis.txt": "How to design a chassis\n\n\n\nConfigurations\n\n\n\n\n\nMaterials",
    "How-To_ Set Up_Program Your Transmitter.txt": "How to program your transmitter\n\nA transmitter is the remote controller that you hold to control the robot. It’s commonly confused with the receiver, a small box that sits inside the robot taking instructions from the transmitter and sending them to the ESCs. Since it’s an important part of transmitter setup, this guide covers how to set up a receiver too. \n\nWhat kind of transmitter are you using?\n\nThis is an important question, because the process is completely different for different transmitters. On CRC as of Spring 2024, we have two kinds of transmitters:\n\nFRSky Taranis X-Lite S\n\nRed, looks kind of like a gaming controller\n\nMore expensive\n\nHas more programmable switches, buttons, and knobs\n\nFancy: supports many model configs, telemetry, and complicated sensitivity curves\n\nRuns on rechargeable batteries, and can be charged via Micro-USB\n\nUsed for Rosie and Beater B. Barker so far\n\nFlySky FS-i6\n\nBlack, looks like an RC plane controller\n\nCheaper\n\nSimpler, but perhaps has a more confusing interface and settings navigation system\n\nRuns on AA batteries (not rechargeable)\n\nUsed for all other bots so far\n\nWhat receiver are you using?\n\nThis is an equally important question, because the receiver has to use the same protocol as the transmitter. This means a receiver that works with the FlySky FS-i6 won’t work with the FRSky Taranis X-Lite. Double check what protocols are supported by the transmitter you’re using, and select a receiver that uses one of those protocols.\n\nHow to get a receiver to work\n\nMake sure it has power. This is easiest to provide using the BEC output from an ESC.\n\nThe BEC output is almost always the middle wire of the 3-pin connector on little wires that comes out of the ESC. If there’s no middle wire, that ESC doesn’t have a BEC.\n\nMake sure you’re connecting the 3-wire connectors in the right orientation. The markings are hard to see, and often the signal and negative markings look quite similar. If an ESC isn’t initializing the way you’re expecting, try flipping the 3-wire connector.\n\nSetup: FrSky Taranis X-Lite\n\nGet the transmitter (it looks like this)\n\n[case, closed]   [transmitter in case, open]\n\n\n\nMake sure it’s charged: plug the transmitter into a USB phone charger with a micro-USB cable.\n\nYou can’t use the transmitter while doing this. If you need to use the transmitter while also charging the batteries, you can swap to a charged pair of batteries and charge the old ones on the dedicated charger we have. See Appendix A1: Charging the batteries externally  how to swap the batteries and charge them externally: \n\nMake sure the antenna is on: screw the antenna onto the top\n\n \n\nPress and hold the power button (button 8) to turn it on\n\nHow navigation works\n\nJoystick 1 is the navigation control joystick– to move between menus, long-hold this joystick to either side to switch between menus.\n\nButton 2 is the back button- press this button to exit out of any option that is selected\n\nButton 3 is a select button. Clicking this button allows you to select and change setting. \n\nJoysticks 4 and 5 are the throttle joysticks. These are used to control the robot, but do not have any use in adjusting the settings. Joystick 4 is for controlling the starboard side of the robot, and Joystick 5 is for controlling the port side of the robot. \n\nButton 6, The + pad, is mostly just for adjusting trims and not used for adjusting the ++settings.\n\nSwitches 7 and 8 are switches that can be configured depending on what you need to toggle. For Beater B Barker, these switches shut off/turn on the weapon and flywheel.  \n\n\n\n\n\n\nProgram: FrSky Taranis X-Lite\n\n\n\nGo to the MIXES screen\n\n\n\n\n\nSelect the channel with the ESC you want to program\n\nAs an example, I will use CH3\n\n\n\nSelect Edit\n\n\n\n\n\nSelect Source\n\nWhile selected, move the control you want the ESC to be bound to\n\n\n\n\n\nTo reverse the direction of a motor, set Weight to -100\n\n\n\n\n\nTo set a switch (typically used for weapon ESCs), scroll down and repeat step 4 with Switch\n\n\n\n\n\nTo bind multiple controls to one channel, select the channel\n\nSelect Insert After\n\nRepeat step 4\n\n\n\n\n\nExample video:\n\ndrive.google.com/file/d/1-B6lAepcTC9rxdcHlyd-PQhjrbcpKTpo/view?usp=drive_link \n\n\n\n\n\n\nAppendix A - Taranis X-Lite\n\nAppendix A1: Charging the batteries externally\n\nThe battery covers are circled below– they unscrew in the direction indicated, and each ‘leg’ holds one 18500 battery. These are RECHARGEABLE lithium ion batteries - don’t throw them away, even though they’re shaped like disposable ones!\n\n [Battery coming out of socket]\n\n\n\nGet the 18500 battery charger (a very specific thing — this is the one we have)\n\n\n\nPut the battery in it\n\nPlug in the USB cable to a phone charger?",
    "Auton Meeting Notes JANFAB Day 4.txt": "JANFAB DAY 4\n\nAaron\nAnanya\nEthan D\nGrace\nJenny\nRiddhi\nRohin\nSophie\nTyler\nShao\nAnika\nRyan\nVinson\nL\nL\nP\nP\nL\nP\nP\nL\nA\nP\nP\nL\nL\nTasks: \nAgenda\n Take attendance! (P if present, L if late, A if absent, E if excused)\n\n\nProject\nMembers\nBrief, informative summary of work done, emphasis on high-level problems and plans for next meeting\nRecovery\nRiddhi LambaSophie Cheng\n- Back-up kicks in as soon as Huey goes off-screen\n- Recovery starts if Huey has been offscreen/unresponsive for too long\n- Tested in videos + live-tested without algo\n- Do tomorrow:\n- Live test\n- Add resizable pop-up for Windows equality\n- Look through algo code and ensure there are no gaps in logic like before\nMechE\nGrace Lim\n- Literally nothing was done today other than make mistakes\n- REMEMBER TO MAKE HOLES\n- Need to print 6 nylon wheels\nSensors\nAnanya JajodiaRohin PhukanShao StassenEthan DeCamp\n- Graph shows sensor vs corner detection orientation \n- Merge with color percentage\n- Synced sensor with corner detection\n\nCorner Detection\nAnika KumarVinson ChenRyan Siglag\n\nTesting\n\n\nSensors: \nMade graph for sensors and corner detection:\n- Confirmed that corner detection is slow but mostly good, and the sensor is fast but wrong, disturbed easily, and it stop reacting after while of constant motion (stop read data occasionally)\n- Realized that either the graph code is slow, or the corner detection drops\nSENSORS POSSIBLE BUGS AND FUTURE FIXES\n- Snapping into recovery when we don't need to \n- Corner detection doesn't work potentially means we have our orientation but don't know which robot is ours\n- Need to patch with the color percentage and coordinate that during merge\nWorked on sync code:\n- At first the sync is flip 180 degrees\n- Now it read sensor then sync the sensor value with corner detection, runs the same rate as corner detection, but now we can estimate driving and still operational even off screen or when not detecting enough corners\n- But need to work with recovery decide when to switch to recovery when corner detection stop working\n\nCorner detection:\n- Realized there was a bug in algo when the enemy bot isnt identified\n- Changed it so it appends the enemy's last known position to enemy positions instead of huey's last known position to huey's positions\n- Merged to develop (thanks shao)\n- Merged code into develop\n- Merged corner detection code into recovery branch\n- Worked well we think?\n- Correctly did huey identification when it identified the enemy png as 2 bots rather than 1\n- HOORAY\n\nAutonomous Meeting Notes\n9/4/2025\n\n\n",
    "Auton Meeting Notes JANFAB Day 5.txt": "JANFAB DAY 5\n\nAaron\nAnanya\nEthan D\nGrace\nJenny\nRiddhi\nRohin\nSophie\nTyler\nShao\nAnika\nRyan\nVinson\nL\nL\nP\nL\nL\nP\nL\nL\nA\nL\nP\nL\nP\nTasks: \nAgenda\n Take attendance! (P if present, L if late, A if absent, E if excused)\n\n\nProject\nMembers\nBrief, informative summary of work done, emphasis on high-level problems and plans for next meeting\nRecovery\nRiddhi LambaSophie Cheng\nJenny Wu\n- Kind of tested backup stuff\n- Now backup alternates between forward and back\n- Corner detection returns Huey even if orientation is not found\n- Next time:\n- Scale with frame rate\n- Live test\n- Use the huey image even without orientation\n- Go through algo (ex. Huey danger zone)\n- Orientation can now be None, while other Huey attributes exist\n- Test check_desired_speed_and_turn: Does orientation default to 0.0, or save last orient? (line 239)\n- Nixed extraneous corner code\nMechE\nGrace Lim\nft Shao Stassen\n- printed the wheels overnight\n- the axle fits!\n- creating the GraShao Groove\n- it is ready to print but still waiting for the 3D printer to be free\nSensors\nAnanya JajodiaRohin PhukanShao StassenEthan DeCampAnika Kumar\nRiddhi Lamba\n? Made the bots dictionary give the position of Huey and Enemy even when corners are not detected\n? Integrated sensors with main.py\n? tested newly soldered imu and esp\n? one works, one doesn't\n? tried to test but ran into many issues :(\n3D-Printing Hell\nVinson ChenRyan Siglag\n- Cleared support on wheel hubs\nTesting\nPersonIn Progress\n\n\n\nAutonomous Meeting Notes\n9/4/2025\n\n\n",
    "TEMPLATE_ Auton Meeting Notes Week _ Meeting _.txt": "Week _ Meeting _\n\nAaron\nAnanya\nEthan D\nGrace\nJenny\nRiddhi\nRohin (who is six feet tall)\nSophie\nTyler\n\n\n\n\n\n\n\n\n\n\nTasks: \nAgenda\n Take attendance! (P if present, L if late, A if absent, E if excused)\n\n\nProject\nMembers\nBrief, informative summary of work done, emphasis on high-level problems and plans for next meeting\n\n\n\n\n\nAutonomous Meeting Notes\n9/4/2025\n\n\n",
    "How-To_ Make a Part Drawing.txt": "How to make a part drawing from a CAD model\n\nHow to make a part drawing:\n\nOpen Fusion. \n\nIn the top left of the screen, there is a box that says “Design.” Click the dropdown menu and select “Drawing,” then “From Design.”\n\n\n\n\n\nIf your part is a component of a greater assembly: In the box that appears, under “Contents,” change “Full Assembly” to “Select.” From there, you can select the part that you want to make a drawing of. (It’s easiest to do this from the dropdown menu to the left as opposed to clicking directly on the CAD. That way you know you’re selecting the correct part). \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUnder “Template,” select “CRC Part Drawing Template” to make sure your part drawing is the correct formatting. \n\nIf “Part Drawing Template” does not appear, go to: Browse → Templates and Backups → Templates → CRC Part Drawing Template\n\nClick OK. \n\nDouble check a few settings:\n\nOn the left, hover over “Document Settings” and click the little gear on the right. \n\nMake sure your units are in inches. \n\nChange “Linear Precision” to 0.1234 and “Angular Precision” to 0.123. \n\nFrom there, start making your drawing! \n\n\n\n\nFor MechE purposes:\n\nThis section will outline some tips for how to make efficient and effective part drawing, so that your machinist can go to the machine shop and NOT have to do any math!\n\n\n\nProjected views\n\nAlways use projected views! (Unless you’re putting an isometric view in the corner for reference.) That way the machinist does not have to guess which side of the part the drawing is referring to. Projected views can be found under Create → Projected View (or the shortcut P). \n\nSymmetry\n\nIf your part has symmetry, use centerlines so you don’t have to do more work than you have to. Centerlines can be found under Geometry → Centerline. Use this to identify the axis across which the part is symmetric. Also make a text note in the empty box that says “Symmetric about centerline(s)” so it’s extra clear to the machinist. \n\nOrdinate Dimensioning\n\nUnder the “Dimensions” tab on the top bar there is an option labeled “Ordinate Dimension.” This is especially useful for parts with lots of dimensions since it vastly clears up the space by creating the dimensions from a common zero point. Use this feature as often as you can to make the drawing as clean as possible. There are pictures below for comparison. \n\nOrdinate dimensions are also much easier for the machinist to use, since it mimics the way the machine actually works. \n\n\n\n\n\n\t\t\tBad\t\t\t\t\t\tGood\n\n\n\n\n\nHole Tool\n\nAll of the holes in the CAD should be made using the Hole Tool, which means that in the drawing, Fusion can automatically dimension the hole with the correct features. Under the “Text” tab on the top bar there is a “Hole and Thread Note” option. Click on this, then click on the hole you want to dimension. This note should include the number of holes that the note pertains to, so you don’t have to repeat this for every single hole. \n\nSee the “Side tangent about holes and threads” section for more information about what all of the stuff on your hole note means. \n\nOther things to include\n\nIn the box in the bottom right corner, be sure to include other features like tolerances and units. The drawing below has typical values for these features, and is also a good example of ordinate dimensioning (good job Ricky👍). \n\nDon’t forget the thickness!! That is usually the most missed dimension since you need a separate projected view from it. (The drawing below doesn’t have it because the thickness is included under “Materials,” but it’s good practice to include it in the drawing anyway so the machinist doesn’t have to look for it.)\n\nExample drawing:\n\n\n\n\n\n\n\n\nSide tangent about holes and threads\n\nBelow is a table of common symbols you’ll see related to your Hole and Thread Note. \n\n\n\nSymbol\n\nWhat it means\n\nWhat you should do about it (if anything)\n\n[A number]X\n\ni.e. 4X\n\nThere are 4 holes on this part that have the same features as this hole.\n\nNothing\n\n\n\nDiameter: A number following this symbol will indicate the diameter of the hole before the tapping operation.\n\nIf this hole is going to be tapped, make sure that the number indicated after the diameter is an actual drill size. Drill sizes are either fraction or numbered; look up which drill bit most closely matches your hole size, and then put that size in parenthesis next to the number so your machinist doesn’t have to look anything up while they’re machining!\n\n\n\nFor example: \n\n\n\n\n\nCounterbore: A number following this symbol will indicate the depth of the counterbore.\n\nNothing\n\n\n\nCountersink: This will be accompanied by a diameter and an angle that the countersink should be. \n\nNothing\n\n\n\nDepth: The number following this symbol indicates how deep the hole should be. \n\nIf you know that the hole is a through hole and does not require a certain depth, then remove this symbol and its number and replace it with the word THRU. It’s more simple and compact, and makes more sense to the machinist. \n\n[A number] - [Another number]\n\ni.e. 10-24, ¼-20, etc.\n\nThis indicates the type of thread: The first number tells you what the diameter is, and the second number tells you the number of threads per inch. \n\n\n\nNote that for diameters below ¼”, the standard turns to number instead of fractions. \n\ni.e. A #10 screw is smaller than a ¼” screw, and a #8 screw is smaller than #10. \n\nNothing\n\nUNC\n\nUnified Coarse Threads: Indicates that the thread type is coarse. (This is what we usually use.)\n\nNothing\n\nUNF\n\nUnified Fine Threads: Indicates that the thread type is fine.\n\nNothing\n\n2A or 2B or anything of the sort\n\nRepresents the class of thread. \n\n\n\n1A, 2A, and 3A apply to external threads. \n\n\n\n1B, 2B, and 3B apply to internal threads. \n\nThe 1, 2, or 3 class isn’t super necessary for our purposes, so feel free to delete (but it doesn’t matter too much).\n\nLH\n\nIndicates the direction of the thread (right-handed or left-handed). \n\nYou should never see LH! Delete an LH if you see it!\n\n\n\nThis happens if people mirror their hole features in the CAD.\n\n\n\nFor Marketing purposes:\n\nThis section will outline how to get good line drawings of robots in any view (side view, isometric, etc.) using Fusion. You can use this for merch, advertising, or whatever you’d like!\n\n\n\nFor example: \n\n\n\n\n\nOpen Fusion\n\nOpen the main file for the bot (the drawing will look exactly like the model you choose)\n\n\n\nClick design\n\n\n\n\n\n\n\n\nClick drawing, then from design\n\n\n\n\n\n\n\n Just click OK\n\n\n\n\n\nNOW DO NOT CLICK ANYWHERE! There should be a little pixelated robot following your cursor as you move it on the drawing space, it looks hella jank but just trust the process\n\nClicking isn’t the end of the world, if you do click scroll down to step 9\n\n\n\n\n\nNow you can change settings as you need. Decrease the scale ratio to make the drawing bigger (try 1:2), or change the perspective of the drawing in orientation\n\n\n\n\n\n\n\nOnce you’re done, click to place the robot down then click OK\n\nThe drawing is now done! But there are some other things on it\n\nIf you accidentally clicked in step 6: right click on the outline and click move to move the drawing\n\nto resize, right click and click edit view\n\n\n\n9a. Once you hit move just click anywhere on the robot then move your mouse and it will move. When you’re done, hit ok\n\n\n\nTo remove the words, just select it, right click, and hit delete (you can also hit the delete button on the keyboard). Do the same with the outer box.\n\n\n\n\n\nIt should look like this:\n\n\n\n\n\nNow you have to export it! Click the drop down from export and click export PDF, then save it to your computer (not to fusion)\n\n\n\n\n\nNow you need a png to remove the background to the outline, so I just take a screenshot of the pdf zoomed in (use F11 for better quality image? Doesn’t rly matter)\n\n\n\n\n\nUse https://remove-white-background.imageonline.co/ or a related background removing website to remove all the white so it’s just the outline\n\nI like that website because you can scale how much white you remove from the photo\n\n\n\n\n\nYou’re done! \n\nIf you want, you can edit the photo in Procreate, Photoshop, etc., just alpha lock the transparent image and draw over it with black because there is a tiny outline in white… \n\nSame goes for if you need a white outline",
    "Auton Meeting Notes JANFAB Day 2.txt": "JANFAB DAY 2\n\nAaron - 6'5\"\nAnanya - height 2 foot\nEthan D - 8' tall\nGrace\nJenny - 3 feet\nRiddhi - 3 inches\nRohin\nSophie\nTyler\nShao:2 feet tall\nAnika: 6 feet tall\nRyan: \nVinson\nAmanda - 20 mm tall\nL\nP\nP\nP\nA\nP\nP\nP\nA\nP\nP\nP\nP\nTasks: \nAgenda\n Take attendance! (P if present, L if late, A if absent, E if excused)\n\n\nProject\nMembers\nBrief, informative summary of work done, emphasis on high-level problems and plans for next meeting\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSensors: \n? Set up the arena \n? Tested the main.py with just the corner detection \n? Seem to work better now\n? Realized before our connection to ground on Arduino is loose\n? Logically, the code still doesn't seem to work\n\n? Tested using sensor data\n? IMU is flip in the bot, so we have to take away the negative\n? Sensor itself become super inaccurate with robot drift\n? Ex. yaw value goes from 180 to 190 degree within 1 second of move and hitting\n? But algorithm and detection seem to behave well \n\n? Tested with 24-25 algorithm code\n? It appears to work better \n? But after clean the wheels, it no longer able to attack the enemies rapidly\n\n? Testing this year's code again\n\nCorner Detection:\n\nTesting:\n? auto save should always be on. PLEASE\n? image.size / 3 bug in Corner Detection is fixed\n? more testing to be done\n\nMechE:\n? Everything is ordered\n? We need to 3D print\n? Most important thing is fixing Bot #2 (the second orange one)\n\nAutonomous Meeting Notes\n9/4/2025\n\n\n",
    "Auton Meeting Notes JANFAB Day 3.txt": "JANFAB DAY 3\n\nAaron\nAnanya\nEthan D\nGrace\nJenny\nRiddhi\nRohin\nSophie\nTyler\nShao\nAnika\nRyan\nVinson\nP\nP\nP\nP\nP\nP\nL\nP\nA\nP\nP\nL\nA\nTasks: \nAgenda\n Take attendance! (P if present, L if late, A if absent, E if excused)\n\n\nProject\nMembers\nBrief, informative summary of work done, emphasis on high-level problems and plans for next meeting\nRecovery\nSophie ChengRiddhi Lamba\n- Added checks for when we drive off camera/into the blindspot\n- Hard coded forward/backward movement to re-enter the frame\n- Live tested, unclear results\n\nMechE:\n- 1 green, 1 blue (there is a lighter blue/not navy blue), 1 orange\n? CLEAT WHEEL: Make the sausages and middle are double the height (0.06in to 0.12in)\n? TO BE PRINTED in Nylon (6x)\n? WHEEL GUARD AND SIDE WALL: Make the screw holes very slightly larger than the diameter of the screws (axel screw holes are now 0.075in radius/0.15 diameter)\n? TO BE PRINTED in TPU (6x each)\nSide Wall Guard (c shape)\nTPU\n15%\nSide Wall (inner)\nTPU\n40%\nWheel Guard (outer)\nTPU\n15%\n\n? Order the flower metal thing 2x\n? It will be ordered at a later point\n\nAutonomous Meeting Notes\n9/4/2025\n\n\n",
    "How To_ Create Renders & Explosion Animations.txt": "How To: Create Renders & Explosion Animations\n\nStep 0: Define Appearances\n\nRight click a component and click Appearance (or, use the A shortcut) \n\nThis allows you to edit the texture and look of the selected component.\n\n\n\nStep 1: Create a Render\n\n          Before:                                                After:\n\n\t\n\n \n\n\n\nFirst, go to Render Tab (under left top corner where it says design)\n\n\n\nGenerative Design = It does CAD for you\n\nRender = Pretty Pics\n\nAnimation = Moving Videos\n\nSimulation = Force/Stress/Heat Analysis\n\nManufacture = CNC Toolpaths\n\nDrawing = Part Drawings for Manufacturing\n\nTop Bar Learning:\n\n \n\nAppearances can also be changed here!\n\nScene Settings in all the Detail you’ll add to the “camera” and “scene”\n\nIn-Canvas Render is testing how it looks before doing the whole \n\nRender Teapot is the FINAL picture (takes time and computationally a bit expensive, so make sure to render when you don’t need your laptop for a bit!)\n\n\n\n\n\nWhen content! Render the picture with a teapot! \n\nIf the pic is too small, zoom in next time or fix the aspect ratio\n\nMake sure to use Cloud render unless you have a beefy graphics card (then you can use local render)\n\nThere will be a library of pics on the bottom once you render!\n\nStep 2: Editing the Scene with Scene Settings \n\n\n\nThree settings: Environment, Ground, Camera\n\n\n\nEnvironment:\n\n\n\nBrightness = Light on Object\n\nPosition = Position of environment and determines reflections and shadows (height + rotation of light)\n\nBackground = Color behind object\n\nNOTE: Still use your mouse settings to move the object around!\n\n\n\nGround:\n\n\n\nGround Plane = creates the floor/ground, inserts shadows\n\nFlatten Ground = puts object on the ground rather than in the air\n\nReflections = adds a reflection of the object like water to the ground\n\n\n\nCamera\n\n\n\nPerspective view makes the setting look real\n\nOrthographic view is where all the lines in the shot are the same distance from the camera\n\nFocal Length = Determines the feel of the object (small focal length makes the object feel bigger)\n\n^ Can make it like a go pro!\n\nReminder: zoom in and pan to place the camera anywhere!\n\nExposure = how long the camera lens is open to collect light (brightness) (phones automatically adjust this)\n\nDepth of Field = this is NOT visible until you start the In-Canvas render (this is the blur from things being too far or too close to the camera, note that the default is a loot of blur)\n\nAspect Ratio = the shape of the screen width over the height (16:9 is the most common and is what computers are)\n\nAdditional Settings\n\nEnvironment Library = 3d world\n\npolyhaven.com has good HDRI environments (files that define environments for Fusion 360 renders). Download .exr or .hdr files, then import into fusion by clicking the button in this photo.\n\nYou can make the transparent background only if the background is solid color and in the render dialogue you have to make sure transparent background is checked with png format \n\n\n\n\n\nIn-Canvas Render:\n\nWhen red it is rendering \n\nSettings (how nice it is level)\n\nThere is a screenshot button\n\n\n\nHow to make an Explosion Animation\n\nFirst: Go to the Animation tab in a full robot assembly\n\n\n\n\n\n\n\nThis is your Storyboard– as you begin animating components in the assembly, the movements will appear as actions in the storyboard, which can be moved around to any time.\n\n\n\n\n\nThis button is the Transform Component button– click it and select a component to edit its X,Y, and Z distance, and angle. \n\n\n\nDrag your selected component to its final position. This animation should appear in your storyboard. \n\n\n\n\n\nKeep on adding multiple different component animations until it’s sufficiently ‘exploded’.\n\nClick Publish to export your animation!\n\n\n\nExample:\n\nBeater B. Barker FORK v20.avi",
    "How-To_ Ansys.txt": "How to Ansys\n\n\n\nDownloading ANSYS\n\nLink to Student Ansys download\n\nThere are a few different free versions of Ansys, but this is the most versatile and will probably suit your needs just fine. \n\nMake sure you have enough space on your computer beforehand, or it won’t finish the download. \n\nAfter download, you want to open the Ansys Workbench. If you have some trouble finding it, this forum question might help. \n\n\n\nSubheading\n\nYou may or may not need this, but here it is just in case. \n\nIf you’re listing steps\n\nto do something, \n\nthen maybe using a \n\nnumbered list\n\nmight be helpful!\n\nMaybe even substeps too…\n\n\n\nRandom Notes to be organized later\n\nStart from the Workbench\n\nFluid Flow → Geometry → DesignModeler\n\nC-shape domain converges better than an oval-shaped domain\n\nCreate domain in a sketch → turn sketch to lines → turn lines into surface → turn solid surface into fluid surface\n\nThis surface represents the fluid surface\n\nNeed to split domain into faces to make the mesh software work easier\n\nWorkbench → Mesh → Mechanical\n\nWant smaller edges near the airfoil (subject)\n\nFirst cell height thickness\n\nFirst cell height at a y+ of 1 (to capture nonlinearity of flow near the surface)\n\nNeed to pick a Reynolds number for the flow\n\nRe → mainstream velocity [m/s] → use this link to get y+ (shown as delta s here)\n\nIf your cell height is less than this value, you’re good\n\nThis will vary across the wall; make sure you check it after the simulation\n\nBoundary conditions\n\nSetup\n\nMake Polyhedral has better convergence quality\n\nVideo on airfoils\n\nVideo on 3D geometry\n\nAn easier video on 3D geometry",
    "How-To_ Safely Test Your Robot.txt": "How to safely test your robot in the test box\n\n\n\nSafety is the most important thing to keep in mind during testing. Even when you are testing a system that’s already been tested before, problems such as sparking or fires can happen at any time, so always follow safety protocols!\n\n\n\nBEFORE TESTING:\n\nMake sure you are aware of the nearest fire extinguisher. For LiPo batteries, you should use a Carbon-Dioxide extinguisher or an ABC Dry Chemical Extinguisher \n\nUsing water on these components will light them on fire more. Please don’t do that.\n\nPrepare the test box. Robots should always be tested in the textbox. Even if the weapon will not be spinning, the testbox can help smother and separate you from the robot in the event of it lighting on fire. \n\nRemoving the weapon lock should be the last thing you do before immediately shutting the test box. The safest order of operations is:\n\nFirst, turn on the transmitter\n\nSecond, turn on the power switch\n\n(Doing this in the opposite order may result in interfering with the fail-safe on the transmitter.) \n\nFinally, remove the weapon lock and IMMEDIATELY close the test box.\n\nNot following this order can lead to ESCs lighting on fire, injuries from a weapon erroneously spinning, and destruction of electronics.\n\n\n\n\n\nDURING TESTING: \n\nDo not open the text box under any circumstances. Opening the textbox can lead to shrapnel or fumes injuring someone. \n\nIf a hole opens up in the textbox, cease testing the robot immediately. Testing must be paused until the hole can be fixed. It is necessary to have a fully enclosed testbox. \n\n\n\n\n\nWHAT TO TEST FOR:\n\nAccording to the Riobotz Combot Tutorial, the most common causes for a robot to lose a match are:\n\nBattery connectors or other wires getting loose \n\nSolution: Use good quality connectors, always use ring terminals over fork terminals, and use liquid electrical tape or hot glue\n\nMotors, batteries, or other components getting loose\n\nSolution: Avoid using nylon ties or clamps, tighten critical screws before each match, use threadlockers or spring locks\n\nChains coming off from sprockets\n\nSolution: Make sure sprockets are well aligned, avoid exposed sprockets, or replace chains with timing belts that withstand larger misalignments.\n\nHeavy impacts due to fall damage:\n\nSolution: Test robot by dropping it from 6ft up, which is around the highest one of our robots would be flung into the air.\n\nImproperly charged or low capacity batteries:\n\nSolution: Always use electronic chargers, check battery voltage before each match, and calculate AND test robot’s consumption under real conditions. \n\nSmoking ESCs:\n\nSolution: Always match the maximum acceptable current in the controller with the motor specs, if a wheel or a spinning weapon gets stuck, turn it off to avoid stalling the motor. \n\nRupture of rivets, screws, nuts:\n\nSolution: never use rivets, always use hardened steel screws and nuts (class 8.8 or 10.9 for hex screws, class 12.9 for Allen, and appropriate diameters for what they will be fastening). \n\nLow-clearance robots getting stuck in the arena:\n\nSolution: Make sure you have a ground clearance of at least ¼” (preferably ⅜”), use flathead screws on the bottom of the robot to ensure they do not get stuck, and don’t forget the wear and tear of wheels.",
    "How-To_ Solder (Guidelines & Tips).txt": "How to solder\n\nGeneral guidelines\n\nDO NOT FORGET HEAT SHRINK!!\n\nThe soldering iron should be between 550 and 600 degrees Fahrenheit (check your units!). Depending on how old/worn out the soldering tip is, you might need to go a bit higher, but you shouldn’t reach 700 degrees.\n\nUse the solder sucker! It’ll keep the fumes out of your face so you don’t breathe them in. \n\nThe key to soldering is holding your iron in one place and waiting. As solder melts, the surface tension will pull the solder towards itself and create a puddle that will be smooth when it melts. That’s how you get the nice shiny finish!\n\n\n\nWire to wire\n\nCombine the wires: You know how in Avatar (the movie with the blue people) they do the hair thing that connects with other hair? That’s what you’re going to do—just like in the first picture, but make sure to press the wires down closer together. (If you have no idea what I’m talking about you may refer to this video for reference.) Alternatively, you can twist your wires together like they’re giving each other a hug, as seen in the second picture. \n\n\t\t\n\nSolder: Glob some solder on there. The more you can get in between the wire threads, the better. Try to make it as smooth as possible, if you can. \n\nFinish: If you don’t have any wires hanging out by themselves and if the wires don’t come apart when you pull them, then you’re probably good. \n\n\n\nWire to XT60/MT60/MR30/MR60\n\nPut heat shrink on your wire! \n\nTin the wire: A good tinned wire should look like the one below (though I would strip the wire maybe half that amount). The biggest plus about tinning is it’ll keep the wire threads from fraying as you put the wire into the connector. A second plus about tinning is that when you heat the solder, you know the solder will already be at the end of the wire that you can’t reach once you’ve put the wire into the connector. Try to put enough solder on so it covers the outside and goes in between the threads a bit, but do not put too much solder on or else you won’t be able to fit it into the connector. \n\n\t\t\n\n\n\nPut the wire into the connector: Pretty self-explanatory. If it doesn’t fit, you’ve probably used too much solder. Use the desoldering tool to take some off. \n\nSolder: Feed the solder into the connector until the solder has basically filled the entire connector slot like a puddle. Ideally, this is what a perfect solder should look like:\n\n\n\nThe two wires should not touch each other at all.\n\nDon’t forget heat shrink!\n\n\n\nWire to bullet connector\n\nTin the wire: See the second step of part C.\n\nPut the wire into the connector. \n\nSolder: There’s a hole in the bullet connector through which you should feed the solder. Hold the iron up to the bullet connector to warm the metal, which should melt the solder that is tinned on your wire. The solder you add should melt upon touching the warm solder on your wire. \n\n\t\t\n\nWire to power switch\n\nsdfasd\n\n\n\nWire to ring connector\n\nPut heat shrink on your wire! \n\nStrip the wire, and without tinning it, put the wire into the tube at the bottom of the ring connector, as seen in the pictures below. \n\nImportant notes: Make sure you have the correct size ring connector for your wire gauge. Also, make sure your ring connector is not insulated (i.e. it should look like the picture below). \n\nYou should see the wire poking out of the top, but it should not extend beyond the length of the tube. \n\n\t\t\n\nCrimp the ring connector to squish the tube around your wire. Some wire strippers have a crimper attached to it (see the picture below). \n\n\t\t\n\nHeat the outside of the tube and feed solder into the wire until it looks nice and smooth. \n\nDo the heat shrink stuff. \n\n\n\nWire to circuit board",
    "How-To_ Design a Spinning Weapon.txt": "How to design a spinning weapon\n\n\n\nOrder of operations: \n\n\n\n\n\nGeometry\n\nRake angle\n\n\n\n\n\n\n\nChoosing a motor\n\nUse this powertrain speccer sheet. \n\n\n\n\n\nDetermining pulley geometry and belt lengths\n\n\n\n\n\nRecommended materials and hardnesses",
    "How-To_ Design a 4-bar Lifter.txt": "How to design a 4-bar lifter\n\n\n\nA 4-bar lifter is an optimized type of lifter that allows the robot to lift both up and out. \n\n\n\n\n\n\n\nWhy use a 4-bar lifter? \n\nThis site has more information on why this type of lifter is good. \n\n\n\nPros: \n\nA 4-bar linkage can be designed to push forward and up as it extends rather than drawing back and away from the opponent as it rises. \n\nThe extension of the lifter arm can be tailored to keep a fairly constant load on the drive motor as it rises, reducing the motor torque requirement while increasing lift speed. \n\nThe mechanism can be made very compact when retracted, so it can stay away from damage from your opponent's weapons but still able to extend to good height when needed.\n\nHaving a hard lower limit means that the lifter arm retracts into the same lowered position every time, so there is no need to manually \"find\" the lowest point as you would with a 360 degree flipper. \n\n\n\nCons: \n\nA 4-bar lifter is more complex than a simple lifter mechanism. \n\nIt is difficult to implement invertibility. \n\nIt does not have 360 degrees of motion. \n\n\n\nHow to design a 4-bar lifter\n\nUse this calculator.",
    "How-To_ Design a Drivetrain.txt": "How to design a drivetrain\n\n\n\nThis document covers: \n\nHow to choose a design\n\nDetermining belt lengths\n\nDesigning drive pulleys\n\nChoosing a drive motor and gearbox combo\n\n\n\nDrive System Design Guide\n\nDrive Calculation Spreadsheet: https://bit.ly/JustCuzDriveCalc\n\nFor the calculator you need to know the # of wheels, # of motors, wheel diameter, and motor specs\n\nMain parameters that determine the needed motor/gearing\n\nWeight class (how much weight can be dedicated to drive?)\n\nDrive Strategy - control, wedge, or other?\n\nSpeed is actually a lower priority for a control bot than a vertical spinner - spinners need to achieve good bite and escape from a bad position\n\nPushing power/low end torque are critical for control bots, especially w/o wedges\n\nGenerally a wedge, lifter, grabber, or other control bot will want more drive power than a spinner\n\nDetermining how much drive power is needed is a function of the desired speed and torque for your chosen wheels\n\nAccording to Ask Aaron’s drivetrain guidelines, you will want at least 1.5-2X the torque required to spin the robot wheels to prevent stalling/overloading the motor while pushing an opponent into or against a wall. \n\nNote: More torque with a reasonable top speed >> stupid fast top speed\n\nHaving the ability to go 100mph if you only have room to accelerate to 20mph means leaving lots of torque on the table\n\nCombat arenas are small - acceleration and pushing power is often far more important than speed, and both are only related to torque and traction\n\nTransferring Power to Wheels - Mechanics and Reductions\n\nDirect drive:\n\nProsoften risky and fragile, but very simple; no external gearing\n\nSupporting the other end of the axle is recommended - easy to destroy the motor with impacts\n\nBasically just don't even think about it with an ungeared motor unless you have a very special circumstance (ultra low kV brushless yolodrive???)\n\nBelt/chain drive\n\nSimplest/easiest way to run 4WD off 2 motors, no tensioning needed if done properly\n\nGenerally easy to attach pulleys to a motor shaft\n\nTypically can get no more than 3:1 per stage\n\nTiming belts or chains are often best for 12lb and up as they won't slip, but round belts work great for smaller bots with lower torque\n\nI managed to use O rings in place of welding my own PU belts in Draconid given sufficient stretch/tension, but this can be difficult to size properly\n\nNote: all plain rubber belts lose significant tension over time\n\n3D printing pulleys for belts works extremely well\n\nPlanetary Gearboxes - Pricey but compact and robust\n\nNot good with impact loads, but often beefy output shafts that easily handle shear loads (best to support the axle if you can though)\n\nHandle a ton of torque and very compact for the high ratios\n\nExtremely expensive to get many P60s or Versas, expect $50-90 per drive side in a 12lb+ bot\n\nOften needs an adapter to use brushless, but usually someone has done it before\n\nCan drive a central pulley and belt to 4WD, or drive one wheel directly and belt to second for extra redundancy (see #5)\n\nGears\n\nMetal gears are expensive but 3D printing is a great option (see Draconid)\n\nLess impact tolerant than belts, but can be designed/made to spec\n\nPretty compact, but very restrictive on center-center\n\nUnlike with pulleys/chains, it's not always possible to change ratios without changing center-center\n\n3D printed herringbone gears have a larger root area, stronger tooth profile\n\nNeed 3 gears per side to reverse direction for 2 motor 4WD\n\nSome guesswork can be involved in determining the width and pitch/module needed\n\nCombinations of the above!\n\nNo harm in combining two different approaches, as long as you’re careful\n\nCan get the best of both worlds by combining gears with belts/chains - high reduction with shock isolation\n\nIt can be much cheaper to replace a shaft and pulley than a two stage gearbox\n\n\n\nWhere to Buy Mechanical Components\n\nYou can buy Chain Sprockets, Gears, Pulleys, wheels and more at Andymark, Vex, ServoCity, McMaster, and more!\n\nP60/P80/P61 gearboxes are at Banebots, and Versaplanetary is Vex. \n\nWheels are available from tons of hobby stores, Amazon, Fingertech, Robotshop, several of the above vendors, etc. \n\nAlso take a look on Ebay, Banggood, or other Chinese retailers but YMMV\n\nBrushless motors are available on Amazon, Hobbyking, Banggood, and any drone/RC hobby store\n\nWheels, wheels, wheels!\n\nSofter rubber is more grippy but less durable\n\nFoam tires are able to take direct hits without trashing your bot unlike rubber (see: D2 kit wheels, Fingertech wheels, lite flights)\n\nCustom silicone cast tires are soft and grippy and often the best performing, but require a lot of experimentation, which means a lot of $$$ and time\n\nBe sure to think about how to actually transmit torque to the wheels\n\nLive shaft turning with the wheel\n\nSet screws on flats (Fingertech hubs)\n\nKeyed hubs (Banebots and similar, common for larger bots)\n\nD or Hex shaft/bore, or spline (also Banebots, VEX stuff, Servocity hubs)\n\nDead shaft - axle doesn’t spin\n\nBolt through to pulley/gear (Conduit)\n\nCustom 3D printed things (Draconid)\n\n\n\nSources:\n\nTeam Tentacle torque Calculator: http://runamok.tech/squid/newtorquecalc.htm\n\nAskAaron Drivetrain Gear Ratios Article: http://runamok.tech/AskAaron/optimum.html\n\nBrushless motor torque estimation article\n\n\n\n\n\nDetermining belt lengths\n\n\n\nRequired Prerequisite:\n\nCenter to Center Distance Between Drive Pulleys\n\nEstimate of Drive Pulley Diameter\n\nLater, will need Final Drive Pulley Diameter\n\n\n\n\n\nDesigning drive pulleys\n\n\n\n\n\nChoosing a drive motor and gearbox combo\n\n\n\nUse this drivetrain speccer template\n\n(If you’re designing a spinning weapon, can also use this template)\n\n\n\nSubheading\n\nYou may or may not need this, but here it is just in case. \n\n\n\nEquation Derivations \n\nYou may or may not need this, but here it is just in case. \n\n\n\nTime to top speed (assuming perfect grip) and final speed calculations\n\n\n\nGiven:\n\nPushing Force F [lbf]\n\nBot Mass m [lbm]\n\nMax velocity  [mph]\n\n\n\nSolve:\n\nFor velocity curve over time: \n\n\n\n\n\n\n\nDesigning cleats\n\n\n\n\n\n\n\nDesigning a walker\n\n\n\n\n\nRecommended materials",
    "How-To_ Bind Receivers to Transmitters.txt": "How to bind receivers to transmitters\n\nFRSky Taranis X-Lite S\n\nStart with the receiver connected to the battery but TURNED OFF\n\nGo to the SETUP screen\n\n\n\n\n\nScroll down to Module\n\nSelect [Reg]\n\n\n\n\n\nWhile the transmitter displays this screen, turn on the receiver WHILE holding down the button on the receiver\n\n\n\n\n\nThe screen should display a “Registration OK” message\n\nPress [ENTER]\n\nPower off the receiver\n\nScroll to Receiver 1\n\n\n\n\n\nSelect Bind\n\n\n\n\n\nWhile the transmitter displays this screen, turn on the receiver WITHOUT holding down the button on the receiver\n\n\n\n\n\nThe screen should display a “Bind Successful” message\n\nTo bind multiple receivers, change the RxNum\n\n\n\n\n\nRepeat steps 3-5\n\nSubstitute Receiver 1 with Receiver 2 in step 6\n\nMark each receiver with its RxNum, you will need to change it based on which receiver you are using\n\nFlySky FS-i6\n\n\n\nPlug the bind key into the receiver\n\nPlug into the B/VCC channel\n\nPower the receiver\n\nPower on the transmitter while holding down the bind key\n\nThe receiver should be binded\n\nThe TX battery level should appear at the top right corner",
    "How-To_ Use the Bambu 3D printer.txt": "How To Use The Bambu 3D Printer\n\nGetting Started\n\nSoftware\n\nDownload Bambu studio app: https://bambulab.com/en/download/studio\n\nDownload it on your phone too! It’s very helpful\n\nSign in to CRC on Bambu Studio\n\nUsername: combatrobotics@cornell.edu\n\nPassword: coolR0bots13!\n\nIn Fusion360, save the part you want to print as .step file (make sure it is NOT hidden)\n\nIf it's a component in a multi-component file:\n\nRight click on component → export → select .step as the filetype\n\nNAME THE EXPORT NICELY!\n\nInclude the name of the file it's from and the current version number of the file. \n\nIf it's a single-component file:\n\nFile → export → select .step as filetype\n\nThe filename should automatically have the version number\n\nImport .step file into Bambu Studio\n\nEnable supports if necessary (see the “Print Details” section for more information.)\n\nLocated in the ‘Supports’ tab\n\nTree style supports are great if you want them to be easier to remove\n\nChange plate to match plate in printer\n\nSlice your part\n\nIf you print and receive the error message “print settings incompatible,” check the nozzle type and make sure it is X1 carbon\n\nAfter following all hardware steps, Print Plate.\n\n\n\n\tHardware\n\nLog into printer\n\nIf you’re not logged in already, scan QR code in the app\n\nIn the app, it’s under the ‘Me’ tab in top right corner next to the bell\n\nChange Filament\n\nGo to ‘Filament’ tab on printer\n\nHit the unspool button (or something along those lines)\n\nFollow the instructions on the printer (just pull the spool off and pull it out of the tube) \n\nIf the old filament prints something while clearing out then use pliers to take it out\n\nMount new filament where the old filament was.\n\nFeed filament through the tube as much as you can.\n\nMake sure that the filament is also fed through the little hole on the spool, as seen in the picture below. This prevents the filament from getting tangled.\n\n\t\t\n\nHit the “put in new filament” button on printer (or something along those lines)\n\nFollow the instructions on the printer\n\nIf it's not sensing anything, push the filament into the tube more\n\nChange plate to match filament\n\nEach physical plate has the description of what materials you can print on it.\n\nPlates can be cleaned in the bathroom with hand soap every so often.\n\nRemember that the plates are double sided! The back of the plate is a different material than the front of the plate.\n\nUse a glue stick on the plate to help the print stick better.\n\nA consistent, thin layer is best; you can put it everywhere on the plate.\n\nIf the plate already has glue, it's okay to add more!\n\n\n\nCleaning the 3D Printer\n\nsomeone fill this i\n\nPrint Details\n\n\tPrinting Everyday Objects/Not Structurally Important Robot Parts\n\nFor the vast majority of projects, settings don’t matter beyond % Infill, which should be set to 15%, and Support Type, which should be set to either Auto or Auto Tree.\n\nHowever, make sure the filament and plate type match what material you’re using to print!\n\n\n\nRobot Parts/Structurally Important Materials:\n\nInfill: This is usually reliable at 15%, however can be adjusted to be higher if needed. This is where most of the weight will come from on components. This is useful with TPU, which has a variable flexibility based on how much infill there is.\n\nWalls: Walls are the number of layers between anything touching open air and infill. This is useful to provide a good amount of material for plastite screws to grip in, or to protect the most vulnerable to contact portions of the part.\n\nProfiles: If trying to get a durable part which can hold up under high loads or impacts, selecting Strength Profile will help immensely. Otherwise, Standard profiles will serve just fine.\n\nCommon Issues\n\nThe Filament Isn’t Extruding!\n\nCause: Filament residue or metal fragments are caught in the extruder.\n\nExplanation: The 3D printer is not a perfect system, and because the hot end, or the part where the filament comes out, has such a small hole, residual fragments of filament, or other debris, can clog the hole.\n\nSolution:\n\nRemove the filament from the 3D printer.\n\nTake off the front of the cube that holds the extruder and hot end. It should be held on only by a few magnets.\n\nUse an allen key to remove the two screws which hold the hot end onto the rest of the printer. Do not detach any of the cables.\n\nUse an allen key to remove the fan which is attached to the side of the hot end. Normally, this fan cools the hot end down. Detach the cable which connects the fan to the rest of the printer.\n\nPut on gloves, and turn on the printer and heat the hot end to 250 degrees. This will begin melting any stuck plastic in the printer.\n\nUsing the long, thin needle that comes with the printer, or any needle smaller than the diameter of the opening of the hot end (Typically .4 mm), begin poking through both ends of the hot end to remove any debris.\n\nI’ve found the most effective way to be to poke from the end where the filament is extruded from, and stick it as far through as possible.\n\nRepeat Step 6 until debris cleared and needle has no trace of residue.\n\nReassemble the printer following the above steps in reverse.\n\nNOTE: If printer is still malfunctioning, the hot end may be too clogged to easily remove debris. In this case, repeat the above steps with a new hot end assembly.\n\nResources:\n\nhttps://wiki.bambulab.com/en/x1/maintenance/replace-complete-hotend\n\n\n\nThe Yellow Gear is Clicking and not Spinning!\n\nCause: Hot end or extruder may be jammed, or filament spool may be caught.\n\nExplanation: The yellow gear you can see on the side of the printer head is part of the component which pushes filament through the printer, called the extruder. For a variety of reasons, this gear can get stuck or jammed, and when it clicks and doesn’t move, this can often be your first indication that extruding is failing.\n\nSolution:\n\nRemove filament from the printer.\n\nNOTE: This may not work with just pressing the unload filament button on the printer. If so, try manually removing the filament by pressing in the lever on the side of the printer to cut the filament, and pressing down on the part where the tubing meets the printer head to release the tubing. Throughout this process, you may be able to remove the filament from the printer by pulling manually.\n\nTake off the front of the cube that holds the extruder and hot end. It should be held on only by a few magnets.\n\nUse an allen key to remove the two screws which hold the hot end onto the rest of the printer. Do not detach any of the cables.\n\nAt this point, you may observe the top of the hot end is clogged by a cut piece of filament. If this is the case, follow the instructions above.\n\nIf this is not the case, follow the instructions below.\n\nUse an allen key to remove the extruder assembly from the printer head. This will be the part directly above where the hot end was. You may now detach the cables which connect the hot end to the printer head.\n\nNow with the completely removed extruder, begin disassembling the extruder by removing the plate held on by four screws.\n\nContinue manually disassembling the extruder until a blockage is uncovered.\n\nReassemble extruder and reconnect printer by following the above instructions.\n\nNOTE: If problem persists, the extruder may be \n\nResources:\n\nhttps://wiki.bambulab.com/en/P1/maintenance/extruder-cleaning-guide\n\nhttps://forum.bambulab.com/t/filament-broken-in-extruder/35553\n\n\n\nThe Filament Cutter isn’t Cutting/Is Repeatedly Clicking Or Getting Stuck!\n\nCause: Something is likely jammed in the extruder or is making the extruder not work properly\n\nExplanation: The filament cutter is what cuts the filament so you can remove old filament and put in new filament. Sometimes, debris or filament gets caught in the extruder, which prevents the filament cutter from functioning properly.\n\nSolution:\n\nFollow above steps to disassemble extruder assembly fully.\n\n\n\nI Can’t Load Filament!\n\nCause: Filament tubing improperly aligned/attached to printer head, or skill issue.\n\nExplanation: The clear white tubing is what guides the filament into the printer head from the spool. Occasionally, this will get out of alignment/lose connection to the printer head, which can make loading filament difficult. Occasionally, this can also be a symptom of the above three issues.\n\nSolution:\n\nRemove faceplate from printer head. This should only be held on by a few magnets.\n\nDepress the circular plunger where the tubing/filament enters the top of the printer head. If the tubing is attached, this should release the tubing.\n\nTry loading the filament without the tubing. If this works as expected, depress the plunger again to reattach the tubing.\n\nNOTE: If this step fails, examine the above instructions for a clogged extruder.\n\nReassemble printer following above instructions in reverse.",
    "How-To_ Set Up a Raspberry Pi.txt": "Setting up Raspberry Pi on a newly bought Pi\n\nFlashing (for a brand new Pi) \n\nIf newly bought, the Pi is just empty, so you need to download the OS to start using it:\n\nGet an adapter that can connect the SD card (typically an empty one)  to the desired device \n\nDownload the Raspberry Pi Imager OS (official website) \n\nThe screen should appear then Select the device and the image model \n\nThe image model could be either from an SD card that was stored on your computer or the following OS provided \n\n\n\nOnce you have selected the options, press next and wait for the imager to finish writing \n\nOnce completed, remove the SD card and put it into the desired Raspberry Pi then plug in the power supply\n\nThe Pi should be on and would need to be hooked up to a monitor (needs a dongle for HDMI), mouse and keyboard\n\nPi should start booting up and display on the screen \n\nYAY, you successfully started up a Pi now go be a menace \n\nImagining and Writing \n\nSimilar to copying the information from a previous SD (imaging), which can either be pasted on a\n\nnew or used pi (writing) \n\n\n\nImagining (either from a previous or new Pi) \n\nReading (for Windows)\n\nTake the SD card from a current pi and connect it to your laptop \n\nDownload the Win32DiskImager\n\nThe following page should show up\n\n(To confirm if the SD is in, under “device” it should show random symbols)\n\n \n\nSelect the folder button in the “image file” box, create a file, and save\n\nReturn to the page and select “Read”\n\nEstimated time should take within minutes or less than an hour \n\n*if hour >1 select cancel, issue I’m not sure of (ask Sebastian) \n\n\n\nWriting (Putting information from a previous SD onto a new SD card) \n\nFollow the “Imaging” direction to have the copy of the previous SD card file that you want to have write on a new SD\n\nTake the new SD you want to write over and plug it into the computer with the file\n\nOpen Win32DiskImager \n\nIn the “Image File” click the folder icon and select the Image of the previous SD \n\nSelect “Write” to start copying over the information to the new SD\n\nOnce the file is complete you have identical SD cards and you can use it how you see fit, Yay!\n\n\n\nSoftware Configuration for Remote Access\n\nOn-board Pi Information\n\nConnect the Pi to a monitor, keyboard, and mouse\n\nConnect the Pi to the RedRover network (more steps involved, but I forgot, sorry -Ethan)\n\nAfter connecting successfully to the network, the IP address will pop up briefly\n\nOtherwise, to access the IP address:\n\nOpen the terminal\n\nType ifconfig\n\nYou should see a terminal output with three sections; under the last section, labelled wlan0, write down the IP address following inet, which should have the form xxx.xxx.xxx.xxx\n\nIn the terminal, type sudo raspi-config\n\nNavigate to “Interface Options”, then “VNC”, and press “Yes” to enable VNC.\n\n\n\nOn Your Computer: Windows\n\nOn your computer now, be sure you have RealVNC installed\n\nRealVNC might prompt you to make an account; simply continue to the account creation, then press cancel\n\nIn the top bar, enter the IP address previously saved\n\nWhen prompted, use the current Raspberry Pi credentials to sign into the Pi\n\nNOTE: Although multiple users can connect to the Pi remotely, they are all functionally controlling the same computer; thus, operations performed by one user will be reflected across all connected devices.\n\nNOTE: The IP address is also liable to change after turning off and on again, so if connection fails, double check you have the right IP address"
}